zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00048.atdf
<avr-tools-device-file xmlns:ns1="http://www.atmel.com/schemas/avr-tools-device-file/mhc" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="4.5" public="true" xsi:noNamespaceSchemaLocation="https://schemas.microchip.com/com/microchip/atdf/4.5/atdf.xsd">
  
  
  <file timestamp="2024-11-05T16:48:03Z" />
  <variants>
    <variant ordercode="PIC32CM5112SG00048-I/NA" ns1:ordercode="PIC32CM5112SG00048-I/NA" package="TQFP48" pinout="P48" speedmax="72000000" tempmin="-40" tempmax="85" vccmin="1.62" vccmax="3.63" />
    <variant ordercode="PIC32CM5112SG00048-V/NA" ns1:ordercode="PIC32CM5112SG00048-V/NA" package="TQFP48" pinout="P48" speedmax="72000000" tempmin="-40" tempmax="105" vccmin="1.62" vccmax="3.63" />
    <variant ordercode="PIC32CM5112SG00048-E/NA" ns1:ordercode="PIC32CM5112SG00048-E/NA" package="TQFP48" pinout="P48" speedmax="72000000" tempmin="-40" tempmax="125" vccmin="1.62" vccmax="3.63" />
    <variant ordercode="PIC32CM5112SG00048-I/NA" ns1:ordercode="PIC32CM5112SG00048-I/NA" package="VQFN48" pinout="P48_1" speedmax="72000000" tempmin="-40" tempmax="85" vccmin="1.62" vccmax="3.63" />
    <variant ordercode="PIC32CM5112SG00048-V/NA" ns1:ordercode="PIC32CM5112SG00048-V/NA" package="VQFN48" pinout="P48_1" speedmax="72000000" tempmin="-40" tempmax="105" vccmin="1.62" vccmax="3.63" />
    <variant ordercode="PIC32CM5112SG00048-E/NA" ns1:ordercode="PIC32CM5112SG00048-E/NA" package="VQFN48" pinout="P48_1" speedmax="72000000" tempmin="-40" tempmax="125" vccmin="1.62" vccmax="3.63" />
  </variants>
  <devices>
    <device name="PIC32CM5112SG00048" architecture="CORTEX-M23" family="PIC32CM" series="PIC32CMSG00">
      <address-spaces>
        <address-space id="base" name="base" start="0" size="0x100000000" endianness="little">
          <memory-segment name="BROMC_ROM" start="0x4000000" size="0x10000" type="rom" rw="R" exec="true" />
          <memory-segment name="FCR_BFM" start="0x8000000" size="0x4000" type="flash" rw="RW" exec="true" />
          <memory-segment name="FCR_CFM_BOOTCFG1A" start="0xA000000" size="0x1000" type="flash" rw="RW" />
          <memory-segment name="FCR_CFM_USEROTP" start="0xA001000" size="0x1000" type="user_signatures" rw="RW" />
          <memory-segment name="FCR_CFM_BOOTCFG1" start="0xA002000" size="0x1000" type="flash" rw="RW" />
          <memory-segment name="FCR_CFM_ROMCFG" start="0xA003000" size="0x1000" type="flash" rw="RW" />
          <memory-segment name="FCR_CFM_VSS0" start="0xA004000" size="0x1000" type="flash" rw="RW" />
          <memory-segment name="FCR_CFM_VSS1" start="0xA005000" size="0x1000" type="flash" rw="RW" />
          <memory-segment name="FCR_CFM_TEST" start="0xA006000" size="0x1000" type="flash" rw="RW" />
          <memory-segment name="FCR_CFM_CALOTP" start="0xA007000" size="0x1000" type="other" rw="R" />
          <memory-segment name="FCR_PFM" start="0xC000000" size="0x80000" type="flash" rw="RW" exec="true" />
          <memory-segment name="MCRAMC_RET" start="0x20000000" size="0x00020000" type="ram" rw="RW" exec="true" />
          <memory-segment name="APB0_BRIDGE" start="0x44000000" size="0x00034000" type="io" rw="RW" />
          <memory-segment name="APB1_BRIDGE" start="0x44800000" size="0x0003a000" type="io" rw="RW" />
          <memory-segment name="APB2_BRIDGE" start="0x45000000" size="0x00010000" type="io" rw="RW" />
          <memory-segment name="HSM_SFR" start="0x4F000000" size="0x18000" type="io" rw="RW" />
          <memory-segment name="PPB" start="0xe0000000" size="0x00100000" type="io" rw="RW" />
        </address-space>
      </address-spaces>
      <idau-regions>
        <idau-region name="BROMC_ROM">
          <subregion name="SEC" id="1" />
        </idau-region>
        <idau-region name="FCR_BFM">
          <subregion name="SEC" id="2" />
          <subregion name="NSC" id="3" />
        </idau-region>
        <idau-region name="FCR_CFM">
          <subregion name="SEC" id="4" />
        </idau-region>
        <idau-region name="FCR_PFM">
          <subregion name="SEC" id="5" />
          <subregion name="NSC" id="6" />
          <subregion name="NS" id="7" />
        </idau-region>
        <idau-region name="MCRAMC_RET">
          <subregion name="SEC" id="8" />
          <subregion name="NS" id="9" />
        </idau-region>
        <idau-region name="APB0_BRIDGE" id="10" />
        <idau-region name="APB1_BRIDGE" id="11" />
        <idau-region name="APB2_BRIDGE" id="12" />
        <idau-region name="HSM_SFR">
          <subregion name="SEC" id="13" />
        </idau-region>
      </idau-regions>
      <parameters>
        <param name="NUM_IRQ" value="141" caption="Number of interrupt request lines" />
        <param name="__BKPT_NUM" value="4" caption="Number of breakpoints comparators" />
        <param name="__CM23_REV" value="0x0000" caption="Cortex-M23 Core Revision" />
        <param name="__ETM_PRESENT" value="0" caption="No Embedded Trace Macro implemented" />
        <param name="__FPU_PRESENT" value="0" caption="No FPU" />
        <param name="__MPU_NS_REGIONS" value="8" caption="Number of Non-Secure Memory Protection Regions" />
        <param name="__MPU_PRESENT" value="1" caption="MPU implemented" />
        <param name="__MPU_REGIONS" value="8" caption="same as __MPU_S_REGIONS" />
        <param name="__MPU_S_REGIONS" value="8" caption="Number of Secure Memory Protection Regions" />
        <param name="__MTB_PRESENT" value="0" caption="No Macro Trace Buffer implemented" />
        <param name="__NVIC_PRIO_BITS" value="2" caption="Number of NVIC Priority Bits" />
        <param name="__SAUREGION_PRESENT" value="0" caption="Number of Security Attribute Unit Regions (No SAU)" />
        <param name="__SEC_ENABLED" value="1" caption="ARMv8-M security extensions (Trust Zone) enabled" />
        <param name="__SYST_NUM" value="2" caption="Number of SYSTICK, include secure and non-secure SYSTICK timers" />
        <param name="__VTOR_PRESENT" value="1" caption="Include Vector Table Offset Register" />
        <param name="__Vendor_SysTickConfig" value="0" caption="Standard SYSTICK used" />
        <param name="__WPT_NUM" value="2" caption="Number of watch point comparators" />
        <param name="POWER_DOMAIN" value="PD_CORE" />
        <param name="__ARCH_ARM" value="1" />
        <param name="__ARCH_ARM_CORTEX_M" value="1" />
      </parameters>
      <peripherals>
        <module name="AC" id="03784" name2="cmp_ac_u2501_v2" version="2a0">
          <instance name="AC">
            <register-group name="AC" name-in-module="AC" address-space="base" offset="0x4482A000" />
            <signals>
              <signal group="AIN" index="0" function="B" pad="PA07" />
              <signal group="AIN" index="1" function="B" pad="PA08" />
              <signal group="AIN" index="2" function="B" pad="PB00" />
              <signal group="AIN" index="3" function="B" pad="PB03" />
              <signal group="CMP" index="0" function="B" pad="PA01" ioset="1" />
              <signal group="CMP" index="1" function="B" pad="PA02" ioset="1" />
            </signals>
            <parameters>
              <param name="ATEST_IMPLEMENTED" value="1" caption="Defines if the ATEST register is implemented" />
              <param name="ATEST_SIZE" value="2" caption="Defines the number of effective bits in ATEST register" />
              <param name="DACVALUE_BIT" value="7" caption="Defines the number of bits in DACCTRLn.VALUE" />
              <param name="IO_INPUTS" value="4" caption="Defines the number of AC pair inputs connected to IO pins" />
              <param name="PAIRS" value="1" caption="Defines the number of AC pairs" />
              <param name="NUM_CMP" value="2" caption="Number of comparators" />
              <param name="LOAD_CALIB" value="0" caption="Defines if calibration is required" />
              <param name="GCLK_ID" value="34" />
              <param name="BRIDGE_ID" value="1" caption="H2PB Bridge ID" />
              <param name="PERIPH_ID" value="21" caption="H2PB Peripheral ID" />
              <param name="INSTANCE_ID" value="40" caption="Instance index for AC" />
              <param name="MCLK_ID_APB" value="50" caption="Index for AC APB clock" />
              <param name="PAC_ID" value="40" caption="Index for AC registers write protection" />
            </parameters>
          </instance>
        </module>
        <module name="ADC" id="03620" name2="adc_msh_ctrl_apb_v1" version="1b0">
          <instance name="ADC">
            <register-group name="ADC" name-in-module="ADC" address-space="base" offset="0x44818000" />
            <signals>
              <signal group="ADC0_AIN" index="0" function="B" pad="PA03" />
              <signal group="ADC0_AIN" index="1" function="B" pad="PA04" />
              <signal group="ADC0_AIN" index="2" function="B" pad="PA05" />
              <signal group="ADC0_AIN" index="3" function="B" pad="PA06" />
              <signal group="ADC0_AIN" index="4" function="B" pad="PA07" />
              <signal group="ADC0_AIN" index="5" function="B" pad="PA08" />
              <signal group="ADC0_AIN" index="6" function="B" pad="PA09" />
              <signal group="ADC0_AIN" index="7" function="B" pad="PB00" />
              <signal group="ADC0_AIN" index="8" function="B" pad="PB03" />
              <signal group="ADC0_AIN" index="9" function="B" pad="PB04" />
              <signal group="ADC0_AIN" index="10" function="B" pad="PB05" />
              <signal group="ADC0_AIN" index="11" function="B" pad="PB06" />
              <signal group="ADC0_ANN" index="0" function="B" pad="PA04" />
              <signal group="ADC0_ANN" index="2" function="B" pad="PA06" />
              <signal group="ADC0_ANN" index="4" function="B" pad="PA08" />
              <signal group="RES_TEST" index="0" function="ADC_TEST_PAD" pad="PD08" />
              <signal group="RES_TEST" index="1" function="ADC_TEST_PAD" pad="PD09" />
              <signal group="RES_TEST" index="2" function="ADC_TEST_PAD" pad="PD07" />
              <signal group="RES_TEST" index="3" function="ADC_TEST_PAD" pad="PA00" />
              <signal group="RES_TEST" index="4" function="ADC_TEST_PAD" pad="PA01" />
              <signal group="RES_TEST" index="5" function="ADC_TEST_PAD" pad="PA02" />
              <signal group="RES_TEST" index="6" function="ADC_TEST_PAD" pad="PA03" />
              <signal group="RES_TEST" index="7" function="ADC_TEST_PAD" pad="PA04" />
              <signal group="RES_TEST" index="8" function="ADC_TEST_PAD" pad="PB03" />
              <signal group="RES_TEST" index="9" function="ADC_TEST_PAD" pad="PB04" />
              <signal group="RES_TEST" index="10" function="ADC_TEST_PAD" pad="PB05" />
              <signal group="RES_TEST" index="11" function="ADC_TEST_PAD" pad="PB06" />
              <signal group="VREFH" function="VOLT_REF" pad="PA09" />
            </signals>
            <parameters>
              <param name="APB_FIFO_DEPTH" value="16" caption="--" />
              <param name="CHNSAR_NMBR1" value="16" caption="--" />
              <param name="CHNSAR_NMBR2" value="0" caption="--" />
              <param name="CHNSAR_NMBR3" value="0" caption="--" />
              <param name="CHNSAR_NMBR4" value="0" caption="--" />
              <param name="DCMP_NMBR" value="1" caption="--" />
              <param name="EARLY_INTR_PRESENT" value="1" caption="--" />
              <param name="FLTR_NMBR" value="1" caption="--" />
              <param name="OCP_ADDR_WIDTH" value="0" caption="--" />
              <param name="OCP_FIFO_DEPTH" value="0" caption="--" />
              <param name="OCP_PORT_PRESENT" value="0" caption="--" />
              <param name="SARCORE_NMBR" value="1" caption="--" />
              <param name="TRGS_NMBR" value="16" caption="--" />
              <param name="VREF_STARTUP_TIME" value="50" caption="--" />
              <param name="GCLK_ID" value="33" />
              <param name="DMAC_ID_PFFRDY" value="37" />
              <param name="BRIDGE_ID" value="1" caption="H2PB Bridge ID" />
              <param name="PERIPH_ID" value="12" caption="H2PB Peripheral ID" />
              <param name="INSTANCE_ID" value="39" caption="Instance index for ADC" />
              <param name="MCLK_ID_APB" value="49" caption="Index for ADC APB clock" />
              <param name="PAC_ID" value="39" caption="Index for ADC registers write protection" />
            </parameters>
          </instance>
        </module>
        <module name="AT" id="04932" name2="sec_anti_tamper_v1" version="1a0">
          <instance name="AT">
            <register-group name="AT" name-in-module="AT" address-space="base" offset="0x4500C000" />
            <parameters>
              <param name="AT_TMPR_OSC_NUM_INV" value="881" caption="Number of inverters in tamper oscillator" />
              <param name="AT_CTRLAPRIV_IMPLEMENTED" value="1" caption="Implement the CTRLA.PRIV bit and privilege access filtering to registers.0 = CTRLA.PRIV not implemented1 = CTRLA.PRIV implemented" />
              <param name="AT_WPCTRL_IMPLEMENTED" value="0" caption="Implement the WPCTRL register for write protection. 1 = Use WPCTRL register is preset . Used to control write protection enable/disable. 0 = No WPCTRL sfr, only used in legacy device with a PACUse at_wrprot to control write protection enable/disable" />
              <param name="AT_WPCTRL_KEY" value="0x412054" caption="WPCTRL 24-bit key value. See register description for usage.Set to a unique value for each macro. ASCII of &quot;A T&quot;" />
              <param name="BRIDGE_ID" value="2" caption="H2PB Bridge ID" />
              <param name="PERIPH_ID" value="6" caption="H2PB Peripheral ID" />
              <param name="INSTANCE_ID" value="45" caption="Instance index for AT" />
              <param name="MCLK_ID_APB" value="56" caption="Index for AT APB clock" />
              <param name="PAC_ID" value="45" caption="Index for AT registers write protection" />
            </parameters>
          </instance>
        </module>
