zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00048.atdf
      <value-group name="CHNCFG5__TRGSRC9">
        <value name="NO_TRIGGER" caption="No Trigger (NOP)" value="0" />
        <value name="GLOBAL_SOFTWARE_TRIGGER" caption="Global Software Trigger" value="1" />
        <value name="GLOBAL_LEVEL_TRIGGER" caption="Global Level Software Trigger" value="2" />
        <value name="SCAN_TRIGGER" caption="SCANTRG - Scan Trigger" value="3" />
        <value name="SYNC_TRIGGER" caption="Synchronous Trigger (STRIG)" value="4" />
        <value name="EVENT_USER0" caption="ADC Trigger Event User 0" value="5" />
        <value name="EVENT_USER1" caption="ADC Trigger Event User 1" value="6" />
        <value name="EVENT_USER2" caption="ADC Trigger Event User 2" value="7" />
        <value name="EVENT_USER3" caption="ADC Trigger Event User 3" value="8" />
        <value name="EVENT_USER4" caption="ADC Trigger Event User 4" value="9" />
        <value name="EVENT_USER5" caption="ADC Trigger Event User 5" value="10" />
        <value name="EVENT_USER6" caption="ADC Trigger Event User 6" value="11" />
        <value name="EVENT_USER7" caption="ADC Trigger Event User 7" value="12" />
        <value name="EVENT_USER8" caption="ADC Trigger Event User 8" value="13" />
        <value name="EVENT_USER9" caption="ADC Trigger Event User 9" value="14" />
        <value name="EVENT_USER10" caption="ADC Trigger Event User 10" value="15" />
      </value-group>
      <value-group name="CHNCFG5__TRGSRC10">
        <value name="NO_TRIGGER" caption="No Trigger (NOP)" value="0" />
        <value name="GLOBAL_SOFTWARE_TRIGGER" caption="Global Software Trigger" value="1" />
        <value name="GLOBAL_LEVEL_TRIGGER" caption="Global Level Software Trigger" value="2" />
        <value name="SCAN_TRIGGER" caption="SCANTRG - Scan Trigger" value="3" />
        <value name="SYNC_TRIGGER" caption="Synchronous Trigger (STRIG)" value="4" />
        <value name="EVENT_USER0" caption="ADC Trigger Event User 0" value="5" />
        <value name="EVENT_USER1" caption="ADC Trigger Event User 1" value="6" />
        <value name="EVENT_USER2" caption="ADC Trigger Event User 2" value="7" />
        <value name="EVENT_USER3" caption="ADC Trigger Event User 3" value="8" />
        <value name="EVENT_USER4" caption="ADC Trigger Event User 4" value="9" />
        <value name="EVENT_USER5" caption="ADC Trigger Event User 5" value="10" />
        <value name="EVENT_USER6" caption="ADC Trigger Event User 6" value="11" />
        <value name="EVENT_USER7" caption="ADC Trigger Event User 7" value="12" />
        <value name="EVENT_USER8" caption="ADC Trigger Event User 8" value="13" />
        <value name="EVENT_USER9" caption="ADC Trigger Event User 9" value="14" />
        <value name="EVENT_USER10" caption="ADC Trigger Event User 10" value="15" />
      </value-group>
      <value-group name="CHNCFG5__TRGSRC11">
        <value name="NO_TRIGGER" caption="No Trigger (NOP)" value="0" />
        <value name="GLOBAL_SOFTWARE_TRIGGER" caption="Global Software Trigger" value="1" />
        <value name="GLOBAL_LEVEL_TRIGGER" caption="Global Level Software Trigger" value="2" />
        <value name="SCAN_TRIGGER" caption="SCANTRG - Scan Trigger" value="3" />
        <value name="SYNC_TRIGGER" caption="Synchronous Trigger (STRIG)" value="4" />
        <value name="EVENT_USER0" caption="ADC Trigger Event User 0" value="5" />
        <value name="EVENT_USER1" caption="ADC Trigger Event User 1" value="6" />
        <value name="EVENT_USER2" caption="ADC Trigger Event User 2" value="7" />
        <value name="EVENT_USER3" caption="ADC Trigger Event User 3" value="8" />
        <value name="EVENT_USER4" caption="ADC Trigger Event User 4" value="9" />
        <value name="EVENT_USER5" caption="ADC Trigger Event User 5" value="10" />
        <value name="EVENT_USER6" caption="ADC Trigger Event User 6" value="11" />
        <value name="EVENT_USER7" caption="ADC Trigger Event User 7" value="12" />
        <value name="EVENT_USER8" caption="ADC Trigger Event User 8" value="13" />
        <value name="EVENT_USER9" caption="ADC Trigger Event User 9" value="14" />
        <value name="EVENT_USER10" caption="ADC Trigger Event User 10" value="15" />
      </value-group>
      <value-group name="CHNCFG5__TRGSRC12">
        <value name="NO_TRIGGER" caption="No Trigger (NOP)" value="0" />
        <value name="GLOBAL_SOFTWARE_TRIGGER" caption="Global Software Trigger" value="1" />
        <value name="GLOBAL_LEVEL_TRIGGER" caption="Global Level Software Trigger" value="2" />
        <value name="SCAN_TRIGGER" caption="SCANTRG - Scan Trigger" value="3" />
        <value name="SYNC_TRIGGER" caption="Synchronous Trigger (STRIG)" value="4" />
        <value name="EVENT_USER0" caption="ADC Trigger Event User 0" value="5" />
        <value name="EVENT_USER1" caption="ADC Trigger Event User 1" value="6" />
        <value name="EVENT_USER2" caption="ADC Trigger Event User 2" value="7" />
        <value name="EVENT_USER3" caption="ADC Trigger Event User 3" value="8" />
        <value name="EVENT_USER4" caption="ADC Trigger Event User 4" value="9" />
        <value name="EVENT_USER5" caption="ADC Trigger Event User 5" value="10" />
        <value name="EVENT_USER6" caption="ADC Trigger Event User 6" value="11" />
        <value name="EVENT_USER7" caption="ADC Trigger Event User 7" value="12" />
        <value name="EVENT_USER8" caption="ADC Trigger Event User 8" value="13" />
        <value name="EVENT_USER9" caption="ADC Trigger Event User 9" value="14" />
        <value name="EVENT_USER10" caption="ADC Trigger Event User 10" value="15" />
      </value-group>
      <value-group name="CHNCFG5__TRGSRC13">
        <value name="NO_TRIGGER" caption="No Trigger (NOP)" value="0" />
        <value name="GLOBAL_SOFTWARE_TRIGGER" caption="Global Software Trigger" value="1" />
        <value name="GLOBAL_LEVEL_TRIGGER" caption="Global Level Software Trigger" value="2" />
        <value name="SCAN_TRIGGER" caption="SCANTRG - Scan Trigger" value="3" />
        <value name="SYNC_TRIGGER" caption="Synchronous Trigger (STRIG)" value="4" />
        <value name="EVENT_USER0" caption="ADC Trigger Event User 0" value="5" />
        <value name="EVENT_USER1" caption="ADC Trigger Event User 1" value="6" />
        <value name="EVENT_USER2" caption="ADC Trigger Event User 2" value="7" />
        <value name="EVENT_USER3" caption="ADC Trigger Event User 3" value="8" />
        <value name="EVENT_USER4" caption="ADC Trigger Event User 4" value="9" />
        <value name="EVENT_USER5" caption="ADC Trigger Event User 5" value="10" />
        <value name="EVENT_USER6" caption="ADC Trigger Event User 6" value="11" />
        <value name="EVENT_USER7" caption="ADC Trigger Event User 7" value="12" />
        <value name="EVENT_USER8" caption="ADC Trigger Event User 8" value="13" />
        <value name="EVENT_USER9" caption="ADC Trigger Event User 9" value="14" />
        <value name="EVENT_USER10" caption="ADC Trigger Event User 10" value="15" />
      </value-group>
      <value-group name="CHNCFG5__TRGSRC14">
        <value name="NO_TRIGGER" caption="No Trigger (NOP)" value="0" />
        <value name="GLOBAL_SOFTWARE_TRIGGER" caption="Global Software Trigger" value="1" />
        <value name="GLOBAL_LEVEL_TRIGGER" caption="Global Level Software Trigger" value="2" />
        <value name="SCAN_TRIGGER" caption="SCANTRG - Scan Trigger" value="3" />
        <value name="SYNC_TRIGGER" caption="Synchronous Trigger (STRIG)" value="4" />
        <value name="EVENT_USER0" caption="ADC Trigger Event User 0" value="5" />
        <value name="EVENT_USER1" caption="ADC Trigger Event User 1" value="6" />
        <value name="EVENT_USER2" caption="ADC Trigger Event User 2" value="7" />
        <value name="EVENT_USER3" caption="ADC Trigger Event User 3" value="8" />
        <value name="EVENT_USER4" caption="ADC Trigger Event User 4" value="9" />
        <value name="EVENT_USER5" caption="ADC Trigger Event User 5" value="10" />
        <value name="EVENT_USER6" caption="ADC Trigger Event User 6" value="11" />
        <value name="EVENT_USER7" caption="ADC Trigger Event User 7" value="12" />
        <value name="EVENT_USER8" caption="ADC Trigger Event User 8" value="13" />
        <value name="EVENT_USER9" caption="ADC Trigger Event User 9" value="14" />
        <value name="EVENT_USER10" caption="ADC Trigger Event User 10" value="15" />
      </value-group>
      <value-group name="CHNCFG5__TRGSRC15">
        <value name="NO_TRIGGER" caption="No Trigger (NOP)" value="0" />
        <value name="GLOBAL_SOFTWARE_TRIGGER" caption="Global Software Trigger" value="1" />
        <value name="GLOBAL_LEVEL_TRIGGER" caption="Global Level Software Trigger" value="2" />
        <value name="SCAN_TRIGGER" caption="SCANTRG - Scan Trigger" value="3" />
        <value name="SYNC_TRIGGER" caption="Synchronous Trigger (STRIG)" value="4" />
        <value name="EVENT_USER0" caption="ADC Trigger Event User 0" value="5" />
        <value name="EVENT_USER1" caption="ADC Trigger Event User 1" value="6" />
        <value name="EVENT_USER2" caption="ADC Trigger Event User 2" value="7" />
        <value name="EVENT_USER3" caption="ADC Trigger Event User 3" value="8" />
        <value name="EVENT_USER4" caption="ADC Trigger Event User 4" value="9" />
        <value name="EVENT_USER5" caption="ADC Trigger Event User 5" value="10" />
        <value name="EVENT_USER6" caption="ADC Trigger Event User 6" value="11" />
        <value name="EVENT_USER7" caption="ADC Trigger Event User 7" value="12" />
        <value name="EVENT_USER8" caption="ADC Trigger Event User 8" value="13" />
        <value name="EVENT_USER9" caption="ADC Trigger Event User 9" value="14" />
        <value name="EVENT_USER10" caption="ADC Trigger Event User 10" value="15" />
      </value-group>
      <value-group name="CTRLD__VREFSEL">
        <value name="AVDD_AVSS" caption="AVDD and AVSS" value="0" />
        <value name="EXTERNAL_VREFH_AVSS" caption="External VREFH and AVSS" value="1" />
      </value-group>
