zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00048.atdf
        <register name="TSS2" offset="0x26C" rw="R" size="4" initval="0x0000A000" caption="Timestamp Status 2">
          <bitfield name="TSP" caption="Timestamp Pointer" mask="0xF" />
          <bitfield name="NTSG" caption="Number of Timestamps Generic" mask="0x3000" />
          <bitfield name="ITBG" caption="Internal Timebase and SOF select Generic" mask="0xC000" />
        </register>
        <register name="TS0" offset="0x270" rw="R" size="4" initval="0x00000000" caption="Timestamp 0">
          <bitfield name="TS" caption="Timestamp Word TS0" mask="0xFFFFFFFF" />
        </register>
        <register name="TS1" offset="0x274" rw="R" size="4" initval="0x00000000" caption="Timestamp 1">
          <bitfield name="TS" caption="Timestamp Word TS1" mask="0xFFFFFFFF" />
        </register>
        <register name="TS2" offset="0x278" rw="R" size="4" initval="0x00000000" caption="Timestamp 2">
          <bitfield name="TS" caption="Timestamp Word TS2" mask="0xFFFFFFFF" />
        </register>
        <register name="TS3" offset="0x27C" rw="R" size="4" initval="0x00000000" caption="Timestamp 3">
          <bitfield name="TS" caption="Timestamp Word TS0" mask="0xFFFFFFFF" />
        </register>
        <register name="TS4" offset="0x280" rw="R" size="4" initval="0x00000000" caption="Timestamp 4">
          <bitfield name="TS" caption="Timestamp Word TS4" mask="0xFFFFFFFF" />
        </register>
        <register name="TS5" offset="0x284" rw="R" size="4" initval="0x00000000" caption="Timestamp 5">
          <bitfield name="TS" caption="Timestamp Word TS5" mask="0xFFFFFFFF" />
        </register>
        <register name="TS6" offset="0x288" rw="R" size="4" initval="0x00000000" caption="Timestamp 6">
          <bitfield name="TS" caption="Timestamp Word TS6" mask="0xFFFFFFFF" />
        </register>
        <register name="TS7" offset="0x28C" rw="R" size="4" initval="0x00000000" caption="Timestamp 7">
          <bitfield name="TS" caption="Timestamp Word TS7" mask="0xFFFFFFFF" />
        </register>
        <register name="TS8" offset="0x290" rw="R" size="4" initval="0x00000000" caption="Timestamp 8">
          <bitfield name="TS" caption="Timestamp Word TS8" mask="0xFFFFFFFF" />
        </register>
        <register name="TS9" offset="0x294" rw="R" size="4" initval="0x00000000" caption="Timestamp 9">
          <bitfield name="TS" caption="Timestamp Word TS9" mask="0xFFFFFFFF" />
        </register>
        <register name="TS10" offset="0x298" rw="R" size="4" initval="0x00000000" caption="Timestamp 10">
          <bitfield name="TS" caption="Timestamp Word TS10" mask="0xFFFFFFFF" />
        </register>
        <register name="TS11" offset="0x29C" rw="R" size="4" initval="0x00000000" caption="Timestamp 11">
          <bitfield name="TS" caption="Timestamp Word TS11" mask="0xFFFFFFFF" />
        </register>
        <register name="TS12" offset="0x2A0" rw="R" size="4" initval="0x00000000" caption="Timestamp 12">
          <bitfield name="TS" caption="Timestamp Word TS12" mask="0xFFFFFFFF" />
        </register>
        <register name="TS13" offset="0x2A4" rw="R" size="4" initval="0x00000000" caption="Timestamp 13">
          <bitfield name="TS" caption="Timestamp Word TS13" mask="0xFFFFFFFF" />
        </register>
        <register name="TS14" offset="0x2A8" rw="R" size="4" initval="0x00000000" caption="Timestamp 14">
          <bitfield name="TS" caption="Timestamp Word TS14" mask="0xFFFFFFFF" />
        </register>
        <register name="TS15" offset="0x2AC" rw="R" size="4" initval="0x00000000" caption="Timestamp 15">
          <bitfield name="TS" caption="Timestamp Word TS15" mask="0xFFFFFFFF" />
        </register>
        <register name="ATB" offset="0x2B0" rw="RW" size="4" atomic-op="clear:ATB" initval="0x00000000" caption="Actual Timebase">
          <bitfield name="TB" caption="Timebase for timestamp generation" mask="0xFFFFFFFF" />
        </register>
      </register-group>
      <register-group name="CAN_MRAM_RXBE" caption="Control Area Network" aligned="4">
        <register name="R0" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Rx Buffer and FIFO Element 0">
          <bitfield name="ID" caption="Identifier" mask="0x1FFFFFFF" />
          <bitfield name="RTR" caption="Remote Transmission Request" mask="0x20000000" />
          <bitfield name="XTD" caption="Extended Identifier" mask="0x40000000" />
          <bitfield name="ESI" caption="Error State Indicator" mask="0x80000000" />
        </register>
        <register name="R1" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Rx Buffer and FIFO Element 1">
          <bitfield name="RXTS" caption="Rx Timestamp" mask="0xFFFF" />
          <bitfield name="DLC" caption="Data Length Code" mask="0xF0000" />
          <bitfield name="BRS" caption="Bit Rate Search" mask="0x100000" />
          <bitfield name="FDF" caption="FD Format" mask="0x200000" />
          <bitfield name="FIDX" caption="Filter Index" mask="0x7F000000" />
          <bitfield name="ANMF" caption="Accepted Non-matching Frame" mask="0x80000000" />
        </register>
        <register name="R2" offset="0x8" rw="RW" size="4" count="16" initval="0x00000000" caption="Rx Buffer and FIFO Element Data">
          <bitfield name="DB0" caption="Data Byte 0" mask="0xFF" />
          <bitfield name="DB1" caption="Data Byte 1" mask="0xFF00" />
          <bitfield name="DB2" caption="Data Byte 2" mask="0xFF0000" />
          <bitfield name="DB3" caption="Data Byte 3" mask="0xFF000000" />
        </register>
      </register-group>
      <register-group name="CAN_MRAM_SIDFE" caption="Control Area Network" aligned="4">
        <register name="S0" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Standard Message ID Filter Element">
          <bitfield name="SFID2" caption="Standard Filter ID 2" mask="0x7FF" />
          <bitfield name="SFID1" caption="Standard Filter ID 1" mask="0x7FF0000" />
          <bitfield name="SFEC" caption="Standard Filter Element Configuration" mask="0x38000000" values="S0__SFEC" />
          <bitfield name="SFT" caption="Standard Filter Type" mask="0xC0000000" values="S0__SFT" />
        </register>
      </register-group>
      <register-group name="CAN_MRAM_TXBE" caption="Control Area Network" aligned="4">
        <register name="T0" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Tx Buffer Element 0">
          <bitfield name="ID" caption="Identifier" mask="0x1FFFFFFF" />
          <bitfield name="RTR" caption="Remote Transmission Request" mask="0x20000000" />
          <bitfield name="XTD" caption="Extended Identifier" mask="0x40000000" />
          <bitfield name="ESI" caption="Error State Indicator" mask="0x80000000" />
        </register>
        <register name="T1" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Tx Buffer Element 1">
          <bitfield name="MMH" caption="Message Marker Higher Byte" mask="0xFF00" />
          <bitfield name="DLC" caption="Identifier" mask="0xF0000" />
          <bitfield name="BRS" caption="Bit Rate Search" mask="0x100000" />
          <bitfield name="FDF" caption="FD Format" mask="0x200000" />
          <bitfield name="TSCE" caption="Time Stamp Capture Enable for TSU" mask="0x400000" />
          <bitfield name="EFC" caption="Event FIFO Control" mask="0x800000" />
          <bitfield name="MML" caption="Message Marker Lower Byte" mask="0xFF000000" />
        </register>
        <register name="T2" offset="0x8" rw="RW" size="4" count="16" initval="0x00000000" caption="Tx Buffer Element Data">
          <bitfield name="DB0" caption="Data Byte 0" mask="0xFF" />
          <bitfield name="DB1" caption="Data Byte 1" mask="0xFF00" />
          <bitfield name="DB2" caption="Data Byte 2" mask="0xFF0000" />
          <bitfield name="DB3" caption="Data Byte 3" mask="0xFF000000" />
        </register>
      </register-group>
