zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00048.atdf
        <register name="INTENSET" offset="0x10" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="EXTINT" caption="External Interrupt Enable" mask="0xFFFF" />
          <bitfield name="NSCHK" caption="Non-secure Check Interrupt Enable" mask="0x80000000" />
        </register>
        <register name="INTFLAG" offset="0x14" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="EXTINT" caption="External Interrupt" mask="0xFFFF" />
          <bitfield name="NSCHK" caption="Non-secure Check Interrupt" mask="0x80000000" />
        </register>
        <register name="ASYNCH" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="External Interrupt Asynchronous Mode">
          <bitfield name="ASYNCH" caption="Asynchronous Edge Detection Mode" mask="0xFFFF" values="ASYNCH__ASYNCH" />
        </register>
        <register name="CONFIG" offset="0x1C" rw="RW" size="4" count="2" initval="0x00000000" caption="External Interrupt Sense Configuration">
          <bitfield name="SENSE0" caption="Input Sense Configuration 0" mask="0x7" values="CONFIG__SENSE0" />
          <bitfield name="FILTEN0" caption="Filter Enable 0" mask="0x8" />
          <bitfield name="SENSE1" caption="Input Sense Configuration 1" mask="0x70" values="CONFIG__SENSE1" />
          <bitfield name="FILTEN1" caption="Filter Enable 1" mask="0x80" />
          <bitfield name="SENSE2" caption="Input Sense Configuration 2" mask="0x700" values="CONFIG__SENSE2" />
          <bitfield name="FILTEN2" caption="Filter Enable 2" mask="0x800" />
          <bitfield name="SENSE3" caption="Input Sense Configuration 3" mask="0x7000" values="CONFIG__SENSE3" />
          <bitfield name="FILTEN3" caption="Filter Enable 3" mask="0x8000" />
          <bitfield name="SENSE4" caption="Input Sense Configuration 4" mask="0x70000" values="CONFIG__SENSE4" />
          <bitfield name="FILTEN4" caption="Filter Enable 4" mask="0x80000" />
          <bitfield name="SENSE5" caption="Input Sense Configuration 5" mask="0x700000" values="CONFIG__SENSE5" />
          <bitfield name="FILTEN5" caption="Filter Enable 5" mask="0x800000" />
          <bitfield name="SENSE6" caption="Input Sense Configuration 6" mask="0x7000000" values="CONFIG__SENSE6" />
          <bitfield name="FILTEN6" caption="Filter Enable 6" mask="0x8000000" />
          <bitfield name="SENSE7" caption="Input Sense Configuration 7" mask="0x70000000" values="CONFIG__SENSE7" />
          <bitfield name="FILTEN7" caption="Filter Enable 7" mask="0x80000000" />
        </register>
        <register name="DEBOUNCEN" offset="0x30" rw="RW" size="4" initval="0x00000000" caption="Debouncer Enable">
          <bitfield name="DEBOUNCEN" caption="Debouncer Enable" mask="0xFFFF" />
        </register>
        <register name="DPRESCALER" offset="0x34" rw="RW" size="4" initval="0x00000000" caption="Debouncer Prescaler">
          <bitfield name="PRESCALER0" caption="Debouncer Prescaler" mask="0x7" values="DPRESCALER__PRESCALER" />
          <bitfield name="STATES0" caption="Debouncer number of states" mask="0x8" values="DPRESCALER__STATES" />
          <bitfield name="PRESCALER1" caption="Debouncer Prescaler" mask="0x70" values="DPRESCALER__PRESCALER" />
          <bitfield name="STATES1" caption="Debouncer number of states" mask="0x80" values="DPRESCALER__STATES" />
          <bitfield name="TICKON" caption="Pin Sampler frequency selection" mask="0x10000" values="DPRESCALER__TICKON" />
        </register>
        <register name="PINSTATE" offset="0x38" rw="R" size="4" initval="0x00000000" caption="Pin State">
          <bitfield name="PINSTATE" caption="Pin State" mask="0xFFFF" />
        </register>
        <register name="NSCHK" offset="0x3C" rw="RW" size="4" initval="0x00000000" caption="Non-secure Interrupt Check Enable">
          <bitfield name="EXTINT" caption="External Interrupt Nonsecure Check Enable" mask="0xFFFF" />
          <bitfield name="NMI" caption="Non-Maskable External Interrupt Nonsecure Check Enable" mask="0x80000000" />
        </register>
        <register name="NONSEC" offset="0x40" rw="RW" size="4" initval="0x00000000" caption="Non-secure Interrupt">
          <bitfield name="EXTINT" caption="External Interrupt Nonsecure Enable" mask="0xFFFF" />
          <bitfield name="NMI" caption="Non-Maskable Interrupt Nonsecure Enable" mask="0x80000000" />
        </register>
      </register-group>
      <value-group name="CTRLA__CKSEL">
        <value name="CLK_GCLK" caption="Clocked by GCLK" value="0" />
        <value name="CLK_ULP32K" caption="Clocked by ULP32K" value="1" />
      </value-group>
      <value-group name="NMICTRL__NMISENSE">
        <value name="NONE" caption="No detection" value="0" />
        <value name="RISE" caption="Rising-edge detection" value="1" />
        <value name="FALL" caption="Falling-edge detection" value="2" />
        <value name="BOTH" caption="Both-edges detection" value="3" />
        <value name="HIGH" caption="High-level detection" value="4" />
        <value name="LOW" caption="Low-level detection" value="5" />
      </value-group>
      <value-group name="NMICTRL__NMIASYNCH">
        <value name="SYNC" caption="Edge detection is clock synchronously operated" value="0" />
        <value name="ASYNC" caption="Edge detection is clock asynchronously operated" value="1" />
      </value-group>
      <value-group name="ASYNCH__ASYNCH">
        <value name="SYNC" caption="EIC_EXTINTx edge detection is synchronously operated" value="0" />
        <value name="ASYNC" caption="EIC_EXTINTx edge detection is asynchronously operated" value="1" />
      </value-group>
      <value-group name="CONFIG__SENSE0">
        <value name="NONE" caption="No detection" value="0" />
        <value name="RISE" caption="Rising edge detection" value="1" />
        <value name="FALL" caption="Falling edge detection" value="2" />
        <value name="BOTH" caption="Both edges detection" value="3" />
        <value name="HIGH" caption="High level detection" value="4" />
        <value name="LOW" caption="Low level detection" value="5" />
      </value-group>
