zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00048.atdf
      <value-group name="CTRLOP__PREPG">
        <value name="DISABLE" caption="Program Operations exclude Pre-Program step" value="0" />
        <value name="ENABLE" caption="Program Operations include Pre-Program step" value="1" />
      </value-group>
      <value-group name="MUTEX__LOCK">
        <value name="UNLOCK" caption="FCW is not locked" value="0" />
        <value name="LOCK" caption="FCW is locked by owner" value="1" />
      </value-group>
      <value-group name="MUTEX__OWNER">
        <value name="NONE" caption="No Owner - always 0 if LOCK=0" value="0" />
        <value name="SYSTEM" caption="The System owns the FCW" value="1" />
      </value-group>
      <value-group name="INTENCLR__DONE">
        <value name="0" caption="Interrupt Disabled" value="0" />
        <value name="1" caption="Interrupt Enabled" value="1" />
      </value-group>
      <value-group name="INTENCLR__KEYERR">
        <value name="0" caption="Interrupt Disabled" value="0" />
        <value name="1" caption="Interrupt Enabled" value="1" />
      </value-group>
      <value-group name="INTENCLR__CFGERR">
        <value name="0" caption="Interrupt Disabled" value="0" />
        <value name="1" caption="Interrupt Enabled" value="1" />
      </value-group>
      <value-group name="INTENCLR__FIFOERR">
        <value name="0" caption="Interrupt Disabled" value="0" />
        <value name="1" caption="Interrupt Enabled" value="1" />
      </value-group>
      <value-group name="INTENCLR__BUSERR">
        <value name="0" caption="Interrupt Disabled" value="0" />
        <value name="1" caption="Interrupt Enabled" value="1" />
      </value-group>
      <value-group name="INTENCLR__WPERR">
        <value name="0" caption="Interrupt Disabled" value="0" />
        <value name="1" caption="Interrupt Enabled" value="1" />
      </value-group>
      <value-group name="INTENCLR__OPERR">
        <value name="0" caption="Interrupt Disabled" value="0" />
        <value name="1" caption="Interrupt Enabled" value="1" />
      </value-group>
      <value-group name="INTENCLR__HTDPGM">
        <value name="0" caption="Interrupt Disabled" value="0" />
        <value name="1" caption="Interrupt Enabled" value="1" />
      </value-group>
      <value-group name="INTENCLR__RSTERR">
        <value name="0" caption="Interrupt Disabled" value="0" />
        <value name="1" caption="Interrupt Enabled" value="1" />
      </value-group>
      <value-group name="INTENCLR__WRERR">
        <value name="0" caption="Interrupt Disabled" value="0" />
        <value name="1" caption="Interrupt Enabled" value="1" />
      </value-group>
      <value-group name="INTENSET__DONE">
        <value name="0" caption="Interrupt Disabled" value="0" />
        <value name="1" caption="Interrupt Enabled" value="1" />
      </value-group>
      <value-group name="INTENSET__KEYERR">
        <value name="0" caption="Interrupt Disabled" value="0" />
        <value name="1" caption="Interrupt Enabled" value="1" />
      </value-group>
      <value-group name="INTENSET__CFGERR">
        <value name="0" caption="Interrupt Disabled" value="0" />
        <value name="1" caption="Interrupt Enabled" value="1" />
      </value-group>
      <value-group name="INTENSET__FIFOERR">
        <value name="0" caption="Interrupt Disabled" value="0" />
        <value name="1" caption="Interrupt Enabled" value="1" />
      </value-group>
      <value-group name="INTENSET__BUSERR">
        <value name="0" caption="Interrupt Disabled" value="0" />
        <value name="1" caption="Interrupt Enabled" value="1" />
      </value-group>
      <value-group name="INTENSET__WPERR">
        <value name="0" caption="Interrupt Disabled" value="0" />
        <value name="1" caption="Interrupt Enabled" value="1" />
      </value-group>
      <value-group name="INTENSET__OPERR">
        <value name="0" caption="Interrupt Disabled" value="0" />
        <value name="1" caption="Interrupt Enabled" value="1" />
      </value-group>
      <value-group name="INTENSET__HTDPGM">
        <value name="0" caption="Interrupt Disabled" value="0" />
        <value name="1" caption="Interrupt Enabled" value="1" />
      </value-group>
      <value-group name="INTENSET__RSTERR">
        <value name="0" caption="Interrupt Disabled" value="0" />
        <value name="1" caption="Interrupt Enabled" value="1" />
      </value-group>
      <value-group name="INTENSET__WRERR">
        <value name="0" caption="Interrupt Disabled" value="0" />
        <value name="1" caption="Interrupt Enabled" value="1" />
      </value-group>
      <value-group name="INTFLAG__DONE">
        <value name="0" caption="NVMOP Not Done" value="0" />
        <value name="1" caption="NVMOP Done" value="1" />
      </value-group>
      <value-group name="INTFLAG__KEYERR">
        <value name="0" caption="No Key Error" value="0" />
        <value name="1" caption="Key Error" value="1" />
      </value-group>
      <value-group name="INTFLAG__CFGERR">
        <value name="0" caption="No CFG Error" value="0" />
        <value name="1" caption="CFC Error" value="1" />
      </value-group>
      <value-group name="INTFLAG__FIFOERR">
        <value name="0" caption="No FIFO Error" value="0" />
        <value name="1" caption="FIFO Error" value="1" />
      </value-group>
      <value-group name="INTFLAG__BUSERR">
        <value name="0" caption="No Bus Error" value="0" />
        <value name="1" caption="Bus Error" value="1" />
      </value-group>
      <value-group name="INTFLAG__WPERR">
        <value name="0" caption="No Write Protection Error" value="0" />
        <value name="1" caption="Write Protection Error" value="1" />
      </value-group>
      <value-group name="INTFLAG__OPERR">
        <value name="0" caption="No NVMOP Error" value="0" />
        <value name="1" caption="Selected Operation is Disabled Error" value="1" />
      </value-group>
      <value-group name="INTFLAG__HTDPGM">
        <value name="0" caption="High Temp NOT Detected" value="0" />
        <value name="1" caption="High Temp Detected (possible data corruption, verify operation)" value="1" />
      </value-group>
      <value-group name="INTFLAG__RSTERR">
        <value name="0" caption="No Reset and Voltage level OK during write/erase" value="0" />
        <value name="1" caption="A reset or Low Voltage Detected (possible data corruption, verify data)" value="1" />
      </value-group>
      <value-group name="INTFLAG__WRERR">
        <value name="0" caption="The Write/Erase sequence completed normally" value="0" />
        <value name="1" caption="The Write/Erase sequence did not complete successfully" value="1" />
      </value-group>
