zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00048.atdf
      <value-group name="CWP__TWP">
        <value name="DISABLE" caption="Erase and Write Protection for this Page is Disabled" value="0" />
        <value name="ENABLE" caption="Erase and Write Protection for this Page is Enable" value="1" />
      </value-group>
      <value-group name="CWP__COWP">
        <value name="DISABLE" caption="Erase and Write Protection for this Page is Disabled" value="0" />
        <value name="ENABLE" caption="Erase and Write Protection for this Page is Enabled" value="1" />
      </value-group>
      <value-group name="CWP__BC1AWPLOCK">
        <value name="UNLOCKED" caption="The Lock &amp;amp; Write Protect bits for this Page are NOT Locked and can be modified" value="0" />
        <value name="LOCKED" caption="The Lock &amp;amp; Write Protect bits for this Page are Locked and cannot be modified" value="1" />
      </value-group>
      <value-group name="CWP__BC1WPLOCK">
        <value name="UNLOCKED" caption="The Lock &amp;amp; Write Protect bits for this Page are NOT Locked and can be modified" value="0" />
        <value name="LOCKED" caption="The Lock &amp;amp; Write Protect bits for this Page are Locked and cannot be modified" value="1" />
      </value-group>
      <value-group name="CWP__RCWPLOCK">
        <value name="UNLOCKED" caption="The Lock &amp;amp; Write Protect bits for this Page are NOT Locked and can be modified" value="0" />
        <value name="LOCKED" caption="The Lock &amp;amp; Write Protect bits for this Page are Locked and cannot be modified" value="1" />
      </value-group>
      <value-group name="CWP__VSSWPLOCK">
        <value name="UNLOCKED" caption="The Lock &amp;amp; Write Protect bits for this Page are NOT Locked and can be modified" value="0" />
        <value name="LOCKED" caption="The Lock &amp;amp; Write Protect bits for this Page are Locked and cannot be modified" value="1" />
      </value-group>
      <value-group name="CWP__TWPLOCK">
        <value name="UNLOCKED" caption="The Lock &amp;amp; Write Protect bits for this Page are NOT Locked and can be modified" value="0" />
        <value name="LOCKED" caption="The Lock &amp;amp; Write Protect bits for this Page are Locked and cannot be modified" value="1" />
      </value-group>
      <value-group name="CWP__COWPLOCK">
        <value name="UNLOCKED" caption="The Lock &amp;amp; Write Protect bits for this Page are NOT Locked and can be modified" value="0" />
        <value name="LOCKED" caption="The Lock &amp;amp; Write Protect bits for this Page are Locked and cannot be modified" value="1" />
      </value-group>
    </module>
    <module name="FPB" id="SYSTEM_IP" version="1.0.0" caption="Flash Patch and Breakpoint">
      <register-group name="FPB" caption="Flash Patch and Breakpoint">
        <register name="FP_CTRL" offset="0x0" rw="RW" size="4" access-size="4" caption="Flash Patch Control Register">
          <bitfield name="ENABLE" caption="Flash Patch global enable" mask="0x1" />
          <bitfield name="KEY" caption="FP_CTRL write-enable key" mask="0x2" />
          <bitfield name="NUM_CODE" caption="Number of implemented code comparators bits [3:0]" mask="0xF0" />
          <bitfield name="NUM_LIT" caption="Number of literal comparators" mask="0xF00" />
          <bitfield name="NUM_CODE_1" caption="Number of implemented code comparators bits [6:4]" mask="0x7000" />
          <bitfield name="REV" caption="Revision" mask="0xF0000000" />
        </register>
        <register name="FP_REMAP" offset="0x4" rw="R" size="4" access-size="4" caption="Flash Patch Remap Register">
          <bitfield name="REMAP" caption="Remap address" mask="0x1FFFFFE0" />
          <bitfield name="RMPSPT" caption="Remap supported" mask="0x20000000" />
        </register>
        <register name="FP_COMP" offset="0x8" rw="RW" size="4" access-size="4" count="4" caption="Flash Patch Comparator Register n">
          <mode name="BREAKPOINT" />
          <mode name="DEFAULT" />
          <bitfield name="BE" caption="Breakpoint enable" mask="0x1" />
          <bitfield modes="DEFAULT" name="FPADDR" caption="Flash Patch address" mask="0x1FFFFFFC" />
          <bitfield modes="DEFAULT" name="FE" caption="Flash Patch enable" mask="0x80000000" />
          <bitfield modes="BREAKPOINT" name="BPADDR" caption="Breakpoint address" mask="0xFFFFFFFE" />
        </register>
        <register name="FP_LAR" offset="0xFB0" rw="W" size="4" access-size="4" caption="FPB Software Lock Access Register">
          <bitfield name="KEY" caption="Lock access control" mask="0xFFFFFFFF" values="FP_LAR__KEY" />
        </register>
        <register name="FP_LSR" offset="0xFB4" rw="R" size="4" access-size="4" caption="FPB Software Lock Status Register">
          <bitfield name="SLI" caption="Software Lock implemented" mask="0x1" />
          <bitfield name="SLK" caption="Software Lock status" mask="0x2" />
          <bitfield name="nTT" caption="Not thirty-two bit" mask="0x4" />
        </register>
        <register name="FP_DEVARCH" offset="0xFBC" rw="R" size="4" access-size="4" initval="0x47701A03" caption="FPB Device Architecture Register">
          <bitfield name="ARCHPART" caption="Architecture Part" mask="0xFFF" />
          <bitfield name="ARCHVER" caption="Architecture Version" mask="0xF000" />
          <bitfield name="REVISION" caption="Revision" mask="0xF0000" />
          <bitfield name="PRESENT" caption="DEVARCH Present" mask="0x100000" />
          <bitfield name="ARCHITECT" caption="Architect" mask="0xFFE00000" />
        </register>
        <register name="FP_DEVTYPE" offset="0xFCC" rw="R" size="4" access-size="4" initval="0x00000000" caption="FPB Device Type Register">
          <bitfield name="MAJOR" caption="Major type" mask="0xF" />
          <bitfield name="SUB" caption="Sub-type" mask="0xF0" />
        </register>
        <register name="FP_PIDR4" offset="0xFD0" rw="R" size="4" access-size="4" caption="FP Peripheral Identification Register 4">
          <bitfield name="DES_2" caption="JEP106 continuation code" mask="0xF" />
          <bitfield name="SIZE" caption="4KB count" mask="0xF0" />
        </register>
