zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00048.atdf
            <register name="IDAU_RCTRL_BFM" offset="0x864" rw="RW" size="4" initval="0x5C000000" caption="Region Control">
            <mode name="BLOCK" caption="Block Based Region" />
            <mode name="WATERMARK" caption="Watermark Based Region" />
            <bitfield modes="BLOCK" name="ARG" caption="IDAU Region Control BFM Command Argument (Block ID)" mask="0x1F" />
            <bitfield modes="WATERMARK" name="ARG" caption="IDAU Region Control BFM Command Argument (Watermark)" mask="0xFFFFFF" />
            <bitfield modes="BLOCK" name="CMD" caption="IDAU Region Control BFM Command" mask="0xFF000000" values="IDAU_RCTRL_BFM_BLOCK__CMD" />
            <bitfield modes="WATERMARK" name="CMD" caption="IDAU Region Control BFM Command" mask="0xFF000000" values="IDAU_RCTRL_BFM_WATERMARK__CMD" />
            </register>
            <register name="IDAU_RCTRL_PFMANS" offset="0x868" rw="RW" size="4" initval="0x5C000000" caption="Region Control">
            <mode name="BLOCK" caption="Block Based Region" />
            <mode name="WATERMARK" caption="Watermark Based Region" />
            <bitfield modes="BLOCK" name="ARG" caption="IDAU Region Control PFMANS Command Argument (Block ID)" mask="0x1F" />
            <bitfield modes="WATERMARK" name="ARG" caption="IDAU Region Control PFMAN Command Argument (Watermark)" mask="0xFFFFFF" />
            <bitfield modes="BLOCK" name="CMD" caption="IDAU Region Control PFMAN Command" mask="0xFF000000" values="IDAU_RCTRL_PFMANS_BLOCK__CMD" />
            <bitfield modes="WATERMARK" name="CMD" caption="IDAU Region Control PFMAN Command" mask="0xFF000000" values="IDAU_RCTRL_PFMANS_WATERMARK__CMD" />
            </register>
            <register name="IDAU_RCTRL_PFMANSC" offset="0x86C" rw="RW" size="4" initval="0x5C000000" caption="Region Control">
            <mode name="BLOCK" caption="Block Based Region" />
            <mode name="WATERMARK" caption="Watermark Based Region" />
            <bitfield modes="BLOCK" name="ARG" caption="IDAU Region Control PFMANSC Command Argument (Block ID)" mask="0x1F" />
            <bitfield modes="WATERMARK" name="ARG" caption="IDAU Region Control PFMANSC Command Argument (Watermark)" mask="0xFFFFFF" />
            <bitfield modes="BLOCK" name="CMD" caption="IDAU Region Control PFMANSC Command" mask="0xFF000000" values="IDAU_RCTRL_PFMANSC_BLOCK__CMD" />
            <bitfield modes="WATERMARK" name="CMD" caption="IDAU Region Control PFMANSC Command" mask="0xFF000000" values="IDAU_RCTRL_PFMANSC_WATERMARK__CMD" />
            </register>
            <register name="IDAU_RCTRL_DRM" offset="0x870" rw="RW" size="4" initval="0x5C000000" caption="Region Control">
            <mode name="BLOCK" caption="Block Based Region" />
            <mode name="WATERMARK" caption="Watermark Based Region" />
            <bitfield modes="BLOCK" name="ARG" caption="IDAU Region Control DRM Command Argument (Block ID)" mask="0x1F" />
            <bitfield modes="WATERMARK" name="ARG" caption="IDAU Region Control DRM Command Argument (Watermark)" mask="0xFFFFFF" />
            <bitfield modes="BLOCK" name="CMD" caption="IDAU Region Control DRM Command" mask="0xFF000000" values="IDAU_RCTRL_DRM_BLOCK__CMD" />
            <bitfield modes="WATERMARK" name="CMD" caption="IDAU Region Control DRM Command" mask="0xFF000000" values="IDAU_RCTRL_DRM_WATERMARK__CMD" />
            </register>
            <register name="IDAU_CTRL_EN" offset="0x874" rw="RW" size="4" initval="0xA5010000" caption="Control">
            <bitfield name="CMD" caption="IDAU Enable Command Register" mask="0xFFFF0000" values="IDAU_CTRL_EN__CMD" />
            </register>
            <register name="IDAU_CTRL_WLCK" offset="0x878" rw="RW" size="4" initval="0xFFFFFFFF" caption="Control">
            <bitfield name="CMD" caption="IDAU Write Lock Command Register" mask="0xFFFF0000" values="IDAU_CTRL_WLCK__CMD" />
            </register>
            <register name="FCW_CWP" offset="0x87C" rw="RW" size="4" initval="0x00000000" caption="CFM Page Write Protect REGISTER">
            <bitfield name="BC1AWP" caption="Panel 1 Write Protect BootCfg1A" mask="0x1" values="FCW_CWP__BC1AWP" />
            <bitfield name="BC1WP" caption="Panel 1 Write Protect BootCfg1" mask="0x4" values="FCW_CWP__BC1WP" />
            <bitfield name="RCWP" caption="Panel 1 Write Protect ROMCfg" mask="0x8" values="FCW_CWP__RCWP" />
            <bitfield name="VSSWP0" caption="Panel 1 Write Protect VSSn" mask="0x10" values="FCW_CWP__VSSWP" />
            <bitfield name="VSSWP1" caption="Panel 1 Write Protect VSSn" mask="0x20" values="FCW_CWP__VSSWP" />
            <bitfield name="BC1AWPLOCK" caption="Panel 1 Lock Write Protection BootCfg1A" mask="0x10000" values="FCW_CWP__BC1AWPLOCK" />
            <bitfield name="BC1WPLOCK" caption="Panel 1 Lock Write Protection BootCfg1" mask="0x40000" values="FCW_CWP__BC1WPLOCK" />
            <bitfield name="RCWPLOCK" caption="Panel 1 Lock Write Protection ROMCfg" mask="0x80000" values="FCW_CWP__RCWPLOCK" />
            <bitfield name="VSSWPLOCK0" caption="Panel 1 Lock Write Protection VSSn" mask="0x100000" values="FCW_CWP__VSSWPLOCK" />
            <bitfield name="VSSWPLOCK1" caption="Panel 1 Lock Write Protection VSSn" mask="0x200000" values="FCW_CWP__VSSWPLOCK" />
            </register>
            <register name="FCR_CRP" offset="0x880" rw="RW" size="4" initval="0x00000000" caption="CFM Page Read Protection Register">
            <bitfield name="BC1ARP" caption="Panel 1 Read Protect BootCfg1A" mask="0x1" values="FCR_CRP__BC1ARP" />
            <bitfield name="BC1RP" caption="Panel 1 Read Protect BootCfg1" mask="0x4" values="FCR_CRP__BC1RP" />
            <bitfield name="RCRP" caption="Panel 1 Read Protect ROMCfg" mask="0x8" values="FCR_CRP__RCRP" />
            <bitfield name="VSSRP0" caption="Panel 1 Read Protect VSSn" mask="0x10" values="FCR_CRP__VSSRP" />
            <bitfield name="VSSRP1" caption="Panel 1 Read Protect VSSn" mask="0x20" values="FCR_CRP__VSSRP" />
            <bitfield name="BC1ARPLOCK" caption="Panel 1 Lock Read Protection BootCfg1A" mask="0x10000" values="FCR_CRP__BC1ARPLOCK" />
            <bitfield name="BC1RPLOCK" caption="Panel 1 Lock Read Protection BootCfg1" mask="0x40000" values="FCR_CRP__BC1RPLOCK" />
            <bitfield name="RCRPLOCK" caption="Panel 1 Lock Read Protection ROMCfg" mask="0x80000" values="FCR_CRP__RCRPLOCK" />
            <bitfield name="VSSRPLOCK0" caption="Panel 1 Lock Read Protection VSSn" mask="0x100000" values="FCR_CRP__VSSRPLOCK" />
            <bitfield name="VSSRPLOCK1" caption="Panel 1 Lock Read Protection VSSn" mask="0x200000" values="FCR_CRP__VSSRPLOCK" />
            </register>
