zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00048.atdf
        <register name="FCCFG33" offset="0x104" rw="R" size="4" caption="DSU Device Configuration 1 Register">
          <bitfield name="ME_HSM" caption="Module enables for Variant configuration" mask="0x80" values="FCCFG33__ME_HSM" />
          <bitfield name="ME_TCC0" caption="Module enables for Variant configuration" mask="0x100" values="FCCFG33__ME_TCC0" />
          <bitfield name="ME_TCC1" caption="Module enables for Variant configuration" mask="0x200" values="FCCFG33__ME_TCC1" />
          <bitfield name="ME_TCC2" caption="Module enables for Variant configuration" mask="0x400" values="FCCFG33__ME_TCC2" />
          <bitfield name="ME_TCC3" caption="Module enables for Variant configuration" mask="0x800" values="FCCFG33__ME_TCC3" />
          <bitfield name="ME_TCC4" caption="Module enables for Variant configuration" mask="0x1000" values="FCCFG33__ME_TCC4" />
          <bitfield name="ME_TCC5" caption="Module enables for Variant configuration" mask="0x2000" values="FCCFG33__ME_TCC5" />
          <bitfield name="ME_TCC6" caption="Module enables for Variant configuration" mask="0x4000" values="FCCFG33__ME_TCC6" />
          <bitfield name="ME_SERCOM0" caption="Module enables for Variant configuration" mask="0x40000" values="FCCFG33__ME_SERCOM0" />
          <bitfield name="ME_SERCOM1" caption="Module enables for Variant configuration" mask="0x80000" values="FCCFG33__ME_SERCOM1" />
          <bitfield name="ME_SERCOM2" caption="Module enables for Variant configuration" mask="0x100000" values="FCCFG33__ME_SERCOM2" />
          <bitfield name="ME_SERCOM3" caption="Module enables for Variant configuration" mask="0x200000" values="FCCFG33__ME_SERCOM3" />
          <bitfield name="ME_SERCOM4" caption="Module enables for Variant configuration" mask="0x400000" values="FCCFG33__ME_SERCOM4" />
          <bitfield name="ME_SERCOM5" caption="Module enables for Variant configuration" mask="0x800000" values="FCCFG33__ME_SERCOM5" />
          <bitfield name="ME_PTC" caption="Module enables for Variant configuration" mask="0x10000000" values="FCCFG33__ME_PTC" />
        </register>
        <register name="FCCFG34" offset="0x108" rw="R" size="4" caption="DSU Device Configuration 2 Register">
          <bitfield name="ME_CAN0" caption="Module enables for Variant configuration" mask="0x1" values="FCCFG34__ME_CAN0" />
          <bitfield name="ME_CAN1" caption="Module enables for Variant configuration" mask="0x2" values="FCCFG34__ME_CAN1" />
          <bitfield name="ME_USBFS" caption="Module enables for Variant configuration" mask="0x200" values="FCCFG34__ME_USBFS" />
          <bitfield name="ME_DPA" caption="Module enables for Variant configuration" mask="0x800000" values="FCCFG34__ME_DPA" />
          <bitfield name="ME_TRAM" caption="Module enables for Variant configuration" mask="0x40000000" values="FCCFG34__ME_TRAM" />
          <bitfield name="ME_PUF" caption="Module enables for Variant configuration" mask="0x80000000" values="FCCFG34__ME_PUF" />
        </register>
        <register name="FCCFG49" offset="0x144" rw="R" size="4" caption="Calibration Configuration 49 Register">
          <bitfield name="RAMC_EMAW" caption="Write Time Extra Margin Adjust" mask="0x3" values="FCCFG49__RAMC_EMAW" />
          <bitfield name="RAMC_EMA" caption="Cycle and Read Time Extra Margin Adjust" mask="0x1C" values="FCCFG49__RAMC_EMA" />
          <bitfield name="RAMAB_EMAW" caption="Write Time Extra Margin Adjust" mask="0xC0" />
          <bitfield name="RAMAB_EMA" caption="Cycle and Read Time Extra Margin Adjust" mask="0x700" />
          <bitfield name="TRAM_EMAW" caption="Write Time Extra Margin Adjust" mask="0x3000" />
          <bitfield name="TRAM_EMA" caption="Cycle and Read Time Extra Margin Adjust" mask="0x1C000" />
          <bitfield name="TRAM_EMAS" caption="Sense Amp Extra Margin Adjust" mask="0x20000" values="FCCFG49__TRAM_EMAS" />
          <bitfield name="BROM_EMA" caption="Cycle and Read Time Extra Margin Adjust" mask="0x700000" />
          <bitfield name="PUF_EMAW" caption="Write Time Extra Margin Adjust" mask="0x3000000" />
          <bitfield name="PUF_EMA" caption="Cycle and Read Time Extra Margin Adjust" mask="0x1C000000" />
          <bitfield name="PUF_EMAS" caption="Sense Amp Extra Margin Adjust" mask="0x20000000" values="FCCFG49__PUF_EMAS" />
        </register>
        <register name="FCCFG56" offset="0x160" rw="R" size="4" caption="Calibration Configuration 56 Register">
          <bitfield name="BRINGOSC" caption="SUPC Ring-osc depth" mask="0x3" values="FCCFG56__BRINGOSC" />
          <bitfield name="DIS_BOR12_RAMON" caption="Disable BOR12 (VREGRAM comparator) when RAM are turned ON when leaving sleep mode" mask="0x10" />
          <bitfield name="DIS_BOR12_VSCALING" caption="Disable BOR12 (VREGRAM comparator) when down voltage scaling is on going from 1.2v to 0.8v to workaround VREG undershoot issue" mask="0x20" />
          <bitfield name="VLP2FPST" caption="Vreg Low Power to Full Power Stabilization Time" mask="0x30000" values="FCCFG56__VLP2FPST" />
          <bitfield name="VLPMST" caption="Vreg LP Mode Stabilization Time" mask="0xC0000" values="FCCFG56__VLPMST" />
          <bitfield name="VTONST" caption="Vreg Turned On Stabilization Time" mask="0x300000" values="FCCFG56__VTONST" />
          <bitfield name="VPDDST" caption="Vreg Pull Down Disable Stabilization Time" mask="0xC00000" values="FCCFG56__VPDDST" />
          <bitfield name="VDVSST" caption="Vreg Down Voltage Scaling Stabilization Time" mask="0x3000000" values="FCCFG56__VDVSST" />
        </register>
        <register name="FCCFG57" offset="0x164" rw="R" size="4" caption="Calibration Configuration 57 Register">
          <bitfield name="DLYVAL" caption="Delay Value" mask="0x7F" />
          <bitfield name="IGNACK" caption="Ignore Acknowledge" mask="0x80" values="FCCFG57__IGNACK" />
        </register>
        <register name="FCCFG58" offset="0x168" rw="R" size="4" caption="Calibration Configuration 58 Register">
          <bitfield name="BRINGOSC" caption="Backup Ring Oscillator Size Depth" mask="0x3" values="FCCFG58__BRINGOSC" />
        </register>
        <register name="FCCFG59" offset="0x16C" rw="R" size="4" caption="Calibration Configuration 59 Register">
          <bitfield name="IDAU_EN" caption="IDAU Enabled" mask="0x1" values="FCCFG59__IDAU_EN" />
        </register>
        <register name="FCCFG60" offset="0x170" rw="R" size="4" caption="Calibration Configuration 60 Register">
          <bitfield name="PUFRAMDNTIME" caption="PUF RAM Power Down Delay Time" mask="0xFFFFFFFF" />
        </register>
