zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00048.atdf
        <value-group name="SUPC_BRCFGUDSSMOR__BOR_HYST">
            <value name="LOW" caption="Low Hysteresis (default)" value="0" />
            <value name="HIGH" caption="High Hysteresis" value="1" />
        </value-group>
        <value-group name="SUPC_BRCFGUDSSMOR__BOR_TRIP">
            <value name="0" caption="1.61V (default)" value="0" />
            <value name="1" caption="2.12V" value="1" />
            <value name="2" caption="2.55V" value="2" />
            <value name="3" caption="2.8V" value="3" />
        </value-group>
        <value-group name="SUPC_BRCFGUCP0__CP">
            <value name="0" caption="Clock gating trip optimized for low output threshold voltage (3.01V)" value="0" />
            <value name="1" caption="Clock gating trip optimized for high output threshold voltage (3.2V) (default)" value="1" />
        </value-group>
        <value-group name="WDT_SETUP__PER">
            <value name="CYC8" caption="8 clock cycles" value="0x0" />
            <value name="CYC16" caption="16 clock cycles" value="0x1" />
            <value name="CYC32" caption="32 clock cycles" value="0x2" />
            <value name="CYC64" caption="64 clock cycles" value="0x3" />
            <value name="CYC128" caption="128 clock cycles" value="0x4" />
            <value name="CYC256" caption="256 clock cycles" value="0x5" />
            <value name="CYC512" caption="512 clock cycles" value="0x6" />
            <value name="CYC1024" caption="1024 clock cycles" value="0x7" />
            <value name="CYC2048" caption="2048 clock cycles" value="0x8" />
            <value name="CYC4096" caption="4096 clock cycles" value="0x9" />
            <value name="CYC8192" caption="8192 clock cycles" value="0xA" />
            <value name="CYC16384" caption="16384 clock cycles" value="0xB" />
        </value-group>
        <value-group name="WDT_SETUP__WINDOW">
            <value name="CYC8" caption="8 clock cycles" value="0x0" />
            <value name="CYC16" caption="16 clock cycles" value="0x1" />
            <value name="CYC32" caption="32 clock cycles" value="0x2" />
            <value name="CYC64" caption="64 clock cycles" value="0x3" />
            <value name="CYC128" caption="128 clock cycles" value="0x4" />
            <value name="CYC256" caption="256 clock cycles" value="0x5" />
            <value name="CYC512" caption="512 clock cycles" value="0x6" />
            <value name="CYC1024" caption="1024 clock cycles" value="0x7" />
            <value name="CYC2048" caption="2048 clock cycles" value="0x8" />
            <value name="CYC4096" caption="4096 clock cycles" value="0x9" />
            <value name="CYC8192" caption="8192 clock cycles" value="0xA" />
            <value name="CYC16384" caption="16384 clock cycles" value="0xB" />
        </value-group>
        <value-group name="WDT_SETUP__EWOFFSET">
            <value name="CYC8" caption="8 clock cycles" value="0x0" />
            <value name="CYC16" caption="16 clock cycles" value="0x1" />
            <value name="CYC32" caption="32 clock cycles" value="0x2" />
            <value name="CYC64" caption="64 clock cycles" value="0x3" />
            <value name="CYC128" caption="128 clock cycles" value="0x4" />
            <value name="CYC256" caption="256 clock cycles" value="0x5" />
            <value name="CYC512" caption="512 clock cycles" value="0x6" />
            <value name="CYC1024" caption="1024 clock cycles" value="0x7" />
            <value name="CYC2048" caption="2048 clock cycles" value="0x8" />
            <value name="CYC4096" caption="4096 clock cycles" value="0x9" />
            <value name="CYC8192" caption="8192 clock cycles" value="0xA" />
            <value name="CYC16384" caption="16384 clock cycles" value="0xB" />      </value-group>
      <value-group name="FRCFGMBIST__MOBB">
        <value name="ENABLED_ANY" caption="MOB runs after any non-BACKUP/HIBERNATE exit reset" value="1" />
        <value name="ENABLED_POR" caption="MOB runs only after a POR" value="2" />
        <value name="DISABLED" caption="MOB Disabled" value="3" />
</value-group>
        <value-group name="BOOT_FLAG__PUFSCORE">
            <value name="0" caption="0" value="0" />
            <value name="1" caption="1" value="1" />
            <value name="2" caption="2" value="2" />
            <value name="3" caption="3" value="3" />
            <value name="4" caption="4" value="4" />
            <value name="5" caption="5" value="5" />
            <value name="6" caption="6" value="6" />
            <value name="7" caption="7" value="7" />
        </value-group>
        <value-group name="PAC_WRCTRL_H2PB0__KEY">
            <value name="OFF" caption="OFF - No Action" value="0" />
            <value name="CLEAR" caption="CLEAR - Clear the peripheral write protection" value="1" />
            <value name="SET" caption="SET - Set the peripheral write protection" value="2" />
            <value name="LOCK" caption="LOCK - Set and Lock the write protection state of the peripheral until the next reset" value="3" />
        </value-group>
        <value-group name="PAC_WRCTRL_H2PB1__KEY">
            <value name="OFF" caption="OFF - No Action" value="0" />
            <value name="CLEAR" caption="CLEAR - Clear the peripheral write protection" value="1" />
            <value name="SET" caption="SET - Set the peripheral write protection" value="2" />
            <value name="LOCK" caption="LOCK - Set and Lock the write protection state of the peripheral until the next reset" value="3" />
        </value-group>
        <value-group name="PAC_WRCTRL_H2PB2__KEY">
            <value name="OFF" caption="OFF - No Action" value="0" />
            <value name="CLEAR" caption="CLEAR - Clear the peripheral write protection" value="1" />
            <value name="SET" caption="SET - Set the peripheral write protection" value="2" />
            <value name="LOCK" caption="LOCK - Set and Lock the write protection state of the peripheral until the next reset" value="3" />
        </value-group>
