zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00048.atdf
        <value-group name="FCR_CRP__RCRPLOCK">
            <value name="UNLOCKED" caption="The Lock &amp;amp;amp; Read Protect bits for this Page are NOT Locked and can be modified" value="0" />
            <value name="LOCKED" caption="The Lock &amp;amp;amp; Read Protect bits for this Page are Locked and cannot be modified" value="1" />
        </value-group>
        <value-group name="FCR_CRP__VSSRPLOCK">
            <value name="UNLOCKED" caption="The Lock &amp;amp;amp; Read Protect bits for this Page are NOT Locked and can be modified" value="0" />
            <value name="LOCKED" caption="The Lock &amp;amp;amp; Read Protect bits for this Page are Locked and cannot be modified" value="1" />
        </value-group>
        <value-group name="FCR_ECCCTRL__ECCCTL">
            <value name="STRICT" caption="ECC Writes with ECC Reads (NVMOP = Single Program Operation disabled)" value="0" />
            <value name="DYNAMIC" caption="Dynamic Writes with Dynamic Reads" value="1" />
            <value name="ECC" caption="ECC Writes with Dynamic Reads (NVMOP = Single Program Operation disabled)" value="2" />
            <value name="DISABLE" caption="Dynamic Writes with No Error Check Reads" value="3" />
        </value-group>
        <value-group name="FCR_ECCCTRL__ECCUNLCK">
            <value name="LOCKED" caption="ECCUNLCK and ECCCTL[1:0] cannot be written" value="0" />
            <value name="UNLOCKED" caption="ECCUNLCK and ECCCTL[1:0] can be written" value="1" />
        </value-group>
        <value-group name="SUPC_BRCFGUSMOR_BOR__HYST_BOR_VDDIO">
            <value name="LOW" caption="Low Hysteresis (default)" value="0" />
            <value name="HIGH" caption="High Hysteresis" value="1" />
        </value-group>
        <value-group name="SUPC_BRCFGUSMOR_BOR__BOR_TRIP_VDDIO">
            <value name="0" caption="1.68V (default)" value="0" />
            <value name="1" caption="2.2V" value="1" />
            <value name="2" caption="2.64V" value="2" />
            <value name="3" caption="2.93V" value="3" />
        </value-group>
        <value-group name="SUPC_BRCFGUSMOR_BOR__HYST_BOR_VDDREG">
            <value name="LOW" caption="Low Hysteresis (default)" value="0" />
            <value name="HIGH" caption="High Hysteresis" value="1" />
        </value-group>
        <value-group name="SUPC_BRCFGUDSSMOR__BOR_HYST">
            <value name="LOW" caption="Low Hysteresis (default)" value="0" />
            <value name="HIGH" caption="High Hysteresis" value="1" />
        </value-group>
        <value-group name="SUPC_BRCFGUDSSMOR__BOR_TRIP">
            <value name="0" caption="1.61V (default)" value="0" />
            <value name="1" caption="2.12V" value="1" />
            <value name="2" caption="2.55V" value="2" />
            <value name="3" caption="2.8V" value="3" />
        </value-group>
        <value-group name="SUPC_BRCFGUCP0__CP">
            <value name="0" caption="Clock gating trip optimized for low output threshold voltage (3.01V)" value="0" />
            <value name="1" caption="Clock gating trip optimized for high output threshold voltage (3.2V) (default)" value="1" />
        </value-group>
        <value-group name="WDT_SETUP__PER">
            <value name="CYC8" caption="8 clock cycles" value="0x0" />
            <value name="CYC16" caption="16 clock cycles" value="0x1" />
            <value name="CYC32" caption="32 clock cycles" value="0x2" />
            <value name="CYC64" caption="64 clock cycles" value="0x3" />
            <value name="CYC128" caption="128 clock cycles" value="0x4" />
            <value name="CYC256" caption="256 clock cycles" value="0x5" />
            <value name="CYC512" caption="512 clock cycles" value="0x6" />
            <value name="CYC1024" caption="1024 clock cycles" value="0x7" />
            <value name="CYC2048" caption="2048 clock cycles" value="0x8" />
            <value name="CYC4096" caption="4096 clock cycles" value="0x9" />
            <value name="CYC8192" caption="8192 clock cycles" value="0xA" />
            <value name="CYC16384" caption="16384 clock cycles" value="0xB" />
        </value-group>
        <value-group name="WDT_SETUP__WINDOW">
            <value name="CYC8" caption="8 clock cycles" value="0x0" />
            <value name="CYC16" caption="16 clock cycles" value="0x1" />
            <value name="CYC32" caption="32 clock cycles" value="0x2" />
            <value name="CYC64" caption="64 clock cycles" value="0x3" />
            <value name="CYC128" caption="128 clock cycles" value="0x4" />
            <value name="CYC256" caption="256 clock cycles" value="0x5" />
            <value name="CYC512" caption="512 clock cycles" value="0x6" />
            <value name="CYC1024" caption="1024 clock cycles" value="0x7" />
            <value name="CYC2048" caption="2048 clock cycles" value="0x8" />
            <value name="CYC4096" caption="4096 clock cycles" value="0x9" />
            <value name="CYC8192" caption="8192 clock cycles" value="0xA" />
            <value name="CYC16384" caption="16384 clock cycles" value="0xB" />
        </value-group>
        <value-group name="WDT_SETUP__EWOFFSET">
            <value name="CYC8" caption="8 clock cycles" value="0x0" />
            <value name="CYC16" caption="16 clock cycles" value="0x1" />
            <value name="CYC32" caption="32 clock cycles" value="0x2" />
            <value name="CYC64" caption="64 clock cycles" value="0x3" />
            <value name="CYC128" caption="128 clock cycles" value="0x4" />
            <value name="CYC256" caption="256 clock cycles" value="0x5" />
            <value name="CYC512" caption="512 clock cycles" value="0x6" />
            <value name="CYC1024" caption="1024 clock cycles" value="0x7" />
            <value name="CYC2048" caption="2048 clock cycles" value="0x8" />
            <value name="CYC4096" caption="4096 clock cycles" value="0x9" />
            <value name="CYC8192" caption="8192 clock cycles" value="0xA" />
            <value name="CYC16384" caption="16384 clock cycles" value="0xB" />      </value-group>
      <value-group name="F1RR__RR0DIS">
        <value name="0" caption="FCR maps the redundant page 0 into the address defined by RR0ADDR" value="0" />
        <value name="1" caption="Redundant page 0 mapping is Disabled" value="1" />
      </value-group>
