zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00048.atdf
        <register name="CryptoMaster_HWConf_Registers__BA418_SHA3_HW_CFG" offset="0x10410" rw="R" size="4" initval="0x00000000" caption="Generic g_Sha3CtxtEn value. BA418-SHA3 configuration.">
          <bitfield name="BA418_SHA3_HW_CFG" caption="Generic g_Sha3CtxtEn value. BA418-SHA3 configuration." mask="0x1" />
        </register>
        <register name="CryptoMaster_HWConf_Registers__BA419_SM4_HW_CFG" offset="0x10414" rw="R" size="4" initval="0x000001FF" caption="Generic g_SM4ModesPoss value. BA419-SM4 engine configuration.">
          <bitfield name="BA419_SM4_HW_CFG" caption="Generic g_SM4ModesPoss value. BA419-SM4 engine configuration." mask="0x1FF" />
        </register>
        <register name="CryptoMaster_HWConf_Registers__BA424_ARIA_HW_CFG" offset="0x10418" rw="R" size="4" initval="0x0000017F" caption="Generic g_aria_modePoss value. BA424-Aria engine configuration.">
          <bitfield name="BA424_ARIA_HW_CFG" caption="Generic g_aria_modePoss value. BA424-Aria engine configuration." mask="0x1FF" />
        </register>
        <register name="RNG_Control_Registers__Control" offset="0x11000" rw="RW" size="4" initval="0x00040000" caption="Control register">
          <bitfield name="Enable" caption="Enable the NDRNG." mask="0x1" />
          <bitfield name="LFSREn" caption="Select between the NDRNG with asynchronous free running oscillators (when '0') and the Pseudo-Random generator with synchronous oscillators for simulation purpose (when '1')." mask="0x2" />
          <bitfield name="TestEn" caption="Select input for conditioning function and continuous tests: 0: Noise source (normal mode), 1: Test data register (test mode)." mask="0x4" />
          <bitfield name="CondBypass" caption="0: the conditioning function is used (normal mode), 1: the conditioning function is bypassed (to observe entropy source directly)." mask="0x8" />
          <bitfield name="IntEnRep" caption="Interrupt enable for Repetition Count Test failure." mask="0x10" />
          <bitfield name="IntEnProp" caption="Interrupt enable for Adaptive Proportion Test failure (1024-sample window)." mask="0x20" />
          <bitfield name="IntEnFull" caption="Interrupt enable for FIFO full." mask="0x80" />
          <bitfield name="SoftRst" caption="Software reset: 0: Normal mode, 1: The continuous test, the conditioning function and the FIFO are reset. This bit is not cleared automatically." mask="0x100" />
          <bitfield name="IntEnPre" caption="Interrupt enable for AIS31 preliminary noise alarm." mask="0x200" />
          <bitfield name="IntEnAlm" caption="Interrupt enable for AIS31 noise alarm." mask="0x400" />
          <bitfield name="ForceActiveROs" caption="Force oscillators to run when FIFO is full." mask="0x800" />
          <bitfield name="HealthTestBypass" caption="Bypass NIST tests such that the results of the start-up and online test do not affect the FSM state." mask="0x1000" />
          <bitfield name="AIS31Bypass" caption="Bypass AIS31 tests such that the results of the start-up and online tests do not affect the FSM state." mask="0x2000" />
          <bitfield name="HealthTestSel" caption="Select input to health test module: 0: Before conditioning, 1: After conditioning." mask="0x4000" />
          <bitfield name="AIS31TestSel" caption="Select input to the AIS31 test module: 0: Before conditioning, 1: After conditioning." mask="0x8000" />
          <bitfield name="Nb128BitBlocks" caption="Number of 128 bit blocks used in AES-CBCMAC post-processing. This value cannot be zero." mask="0xF0000" />
          <bitfield name="FifoWriteStartUp" caption="Enable write of the samples in the FIFO during start-up." mask="0x100000" />
        </register>
        <register name="RNG_Control_Registers__FIFOLevel" offset="0x11004" rw="RW" size="4" initval="0x00000000" caption="FIFO level register.">
          <bitfield name="FIFOLevel" caption="Number of 32 bits words of random available in the FIFO. Any write to this register clears the FullInt flag in the Status register." mask="0xFFFFFFFF" />
        </register>
        <register name="RNG_Control_Registers__FIFOThreshold" offset="0x11008" rw="RW" size="4" initval="0x00000001" caption="FIFO threshold register.">
          <bitfield name="FIFOThreshold" caption="FIFO level below which the module leaves the idle state to refill the FIFO, expressed in number of 128bit blocks." mask="0x3" />
        </register>
        <register name="RNG_Control_Registers__FIFODepth" offset="0x1100C" rw="R" size="4" initval="0x00000008" caption="FIFO depth register.">
          <bitfield name="FIFODepth" caption="Maximum number of 32 bits words that can be stored in the FIFO: 2**g_fifodepth." mask="0xFFFFFFFF" />
        </register>
        <register name="RNG_Control_Registers__Key0" offset="0x11010" rw="RW" size="4" initval="0x00000000" caption="Key register (MSB).">
          <bitfield name="Key0" caption="Key register (MSB)." mask="0xFFFFFFFF" />
        </register>
        <register name="RNG_Control_Registers__Key1" offset="0x11014" rw="RW" size="4" initval="0x00000000" caption="Key register.">
          <bitfield name="Key1" caption="Key register." mask="0xFFFFFFFF" />
        </register>
        <register name="RNG_Control_Registers__Key2" offset="0x11018" rw="RW" size="4" initval="0x00000000" caption="Key register.">
          <bitfield name="Key2" caption="Key register." mask="0xFFFFFFFF" />
        </register>
        <register name="RNG_Control_Registers__Key3" offset="0x1101C" rw="RW" size="4" initval="0x00000000" caption="Key register (LSB).">
          <bitfield name="Key3" caption="Key register (LSB)." mask="0xFFFFFFFF" />
        </register>
        <register name="RNG_Control_Registers__TestData" offset="0x11020" rw="W" size="4" initval="0x00000000" caption="Test data register.">
          <bitfield name="TestData" caption="Test data register." mask="0xFFFFFFFF" />
        </register>
        <register name="RNG_Control_Registers__RepeatThreshold" offset="0x11024" rw="RW" size="4" initval="0x00000029" caption="Repetition Test Count Cut-Off value.">
          <bitfield name="RepeatThreshold" caption="Repetition Test Count Cut-Off value." mask="0x3F" />
        </register>
        <register name="RNG_Control_Registers__PropThreshold" offset="0x11028" rw="RW" size="4" initval="0x00000319" caption="Adaptive Proportion Test (1024-sample window) Cut-Off value.">
          <bitfield name="PropThreshold" caption="Adaptive Proportion Test (1024-sample window) Cut-Off value." mask="0x3FF" />
        </register>
        <register name="RNG_Control_Registers__Status" offset="0x11030" rw="RW" size="4" initval="0x00000000" caption="Status register.">
          <bitfield name="TestDataBusy" caption="High when data written to TestData register is being processed. (see section 4.7)" mask="0x1" />
          <bitfield name="State" caption="State of the control FSM: 000: Reset, 001: Startup, 010: Idle (Rings On), 011: Idle (Rings Off), 100: Fill FIFO, 101: Error, 110: Unused, 111: Unused." mask="0xE" />
          <bitfield name="RepFail" caption="NIST-800-90B repetition Count Test interrupt status." mask="0x10" />
          <bitfield name="PropFail" caption="NIST-800-90B adaptive Proportion Test (1024-sample window) interrupt status." mask="0x20" />
          <bitfield name="FullInt" caption="FIFO full status." mask="0x80" />
          <bitfield name="PreInt" caption="AIS31 preliminary noise alarm interrupt status." mask="0x100" />
          <bitfield name="AlmInt" caption="AIS31 noise alarm interrupt status." mask="0x200" />
          <bitfield name="StartUpFail" caption="Start-up test failure." mask="0x400" />
          <bitfield name="FifoAccFail" caption="Set when a FIFO data read is performed while the NDRNG is disabled AND has its FIFO empty (FIFOLevel = 0)." mask="0x800" />
        </register>
