zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00048.atdf
      <value-group name="RSTATUSA__TYPE">
        <value name="INVALID" caption="Region is invalid" value="0x0" />
        <value name="SEC" caption="Region is secure" value="0x1" />
        <value name="NONSEC" caption="Region is non secure" value="0x2" />
        <value name="NONSEC_W" caption="Region is non secure, the associated register group implements a watermark configuration" value="0x3" />
        <value name="SECnNONSEC_B" caption="Region is either secure or non-secure, the associated register group implements a block configuration" value="0x4" />
        <value name="SECnNONSEC_L" caption="Region is either secure or non-secure, configuration is linked to another IDAU region configuration bit (the linked configuration bit identification info is readable from the RSTATUSC register inside the same register group)" value="0x5" />
        <value name="NSC_W" caption="Region is non-secure callable, the associated register group implements a watermark configuration" value="0x6" />
        <value name="EXEMPT_B" caption="Region is exempt from security, the associated register group implements a block configuration" value="0x7" />
      </value-group>
      <value-group name="RSTATUSA__GRAN">
        <value name="GRAN_NA" caption="Not Applicable" value="0x0" />
        <value name="GRAN_32B" caption="" value="0x5" />
        <value name="GRAN_64B" caption="" value="0x6" />
        <value name="GRAN_128B" caption="" value="0x7" />
        <value name="GRAN_256B" caption="" value="0x8" />
        <value name="GRAN_512B" caption="" value="0x9" />
        <value name="GRAN_1KB" caption="" value="0xA" />
        <value name="GRAN_2KB" caption="" value="0xB" />
        <value name="GRAN_4KB" caption="" value="0xC" />
        <value name="GRAN_8KB" caption="" value="0xD" />
        <value name="GRAN_16KB" caption="" value="0xE" />
        <value name="GRAN_32KB" caption="" value="0xF" />
        <value name="GRAN_64KB" caption="" value="0x10" />
        <value name="GRAN_128KB" caption="" value="0x11" />
        <value name="GRAN_256KB" caption="" value="0x12" />
        <value name="GRAN_512KB" caption="" value="0x13" />
        <value name="GRAN_1MB" caption="" value="0x14" />
        <value name="GRAN_2MB" caption="" value="0x15" />
        <value name="GRAN_4MB" caption="" value="0x16" />
        <value name="GRAN_8MB" caption="" value="0x17" />
        <value name="GRAN_16MB" caption="" value="0x18" />
        <value name="GRAN_32MB" caption="" value="0x19" />
        <value name="GRAN_64MB" caption="" value="0x1A" />
        <value name="GRAN_128MB" caption="" value="0x1B" />
        <value name="GRAN_256MB" caption="" value="0x1C" />
        <value name="GRAN_512MB" caption="" value="0x1D" />
        <value name="GRAN_1GB" caption="" value="0x1E" />
        <value name="GRAN_2GB" caption="" value="0x1F" />
        <value name="GRAN_4GB" caption="" value="0x20" />
      </value-group>
      <value-group name="CTRL__CMD">
        <value name="ENABLE" caption="Module Enable" value="0xA501" />
        <value name="DISABLE" caption="Module Disable" value="0xA502" />
        <value name="WLCK" caption="Write Lock" value="0xA503" />
      </value-group>
    </module>
    <module name="MCLK" id="04158" name2="clk_mclk_v1" version="1a0" caption="Polaris Main Clock Controller">
      <register-group name="MCLK" caption="Polaris Main Clock Controller">
        <register name="INTENCLR" offset="0x0" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear Register">
          <bitfield name="CKRDY" caption="Clock Ready Interrupt Enable Clear" mask="0x1" values="INTENCLR__CKRDY" />
        </register>
        <register name="INTENSET" offset="0x4" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set Register">
          <bitfield name="CKRDY" caption="Clock Ready Interrupt Enable Set" mask="0x1" values="INTENSET__CKRDY" />
        </register>
        <register name="INTFLAG" offset="0x8" rw="W" size="4" atomic-op="clear:INTFLAG" initval="0x00000001" caption="Interrupt Flag Status Register">
          <bitfield name="CKRDY" caption="Clock Ready Interrupt Flag" mask="0x1" />
        </register>
        <register name="CLKDIV" offset="0xC" rw="RW" size="4" count="3" initval="0x00000000" caption="Clock Divider Control n Register">
          <bitfield name="DIV" caption="Clock Domain n Division Factor" mask="0xFF" values="CLKDIV__DIV" />
        </register>
        <register name="CLKMSK" offset="0x3C" rw="RW" size="4" count="9" initval="0x00000000" caption="Peripheral Clock Enable Mask n Register">
          <bitfield name="MASK0" caption="Peripheral Clock Enable Mask" mask="0x1" values="CLKMSK__MASK" />
          <bitfield name="MASK1" caption="Peripheral Clock Enable Mask" mask="0x2" values="CLKMSK__MASK" />
          <bitfield name="MASK2" caption="Peripheral Clock Enable Mask" mask="0x4" values="CLKMSK__MASK" />
          <bitfield name="MASK3" caption="Peripheral Clock Enable Mask" mask="0x8" values="CLKMSK__MASK" />
          <bitfield name="MASK4" caption="Peripheral Clock Enable Mask" mask="0x10" values="CLKMSK__MASK" />
          <bitfield name="MASK5" caption="Peripheral Clock Enable Mask" mask="0x20" values="CLKMSK__MASK" />
          <bitfield name="MASK6" caption="Peripheral Clock Enable Mask" mask="0x40" values="CLKMSK__MASK" />
          <bitfield name="MASK7" caption="Peripheral Clock Enable Mask" mask="0x80" values="CLKMSK__MASK" />
          <bitfield name="MASK8" caption="Peripheral Clock Enable Mask" mask="0x100" values="CLKMSK__MASK" />
          <bitfield name="MASK9" caption="Peripheral Clock Enable Mask" mask="0x200" values="CLKMSK__MASK" />
          <bitfield name="MASK10" caption="Peripheral Clock Enable Mask" mask="0x400" values="CLKMSK__MASK" />
          <bitfield name="MASK11" caption="Peripheral Clock Enable Mask" mask="0x800" values="CLKMSK__MASK" />
          <bitfield name="MASK12" caption="Peripheral Clock Enable Mask" mask="0x1000" values="CLKMSK__MASK" />
          <bitfield name="MASK13" caption="Peripheral Clock Enable Mask" mask="0x2000" values="CLKMSK__MASK" />
          <bitfield name="MASK14" caption="Peripheral Clock Enable Mask" mask="0x4000" values="CLKMSK__MASK" />
          <bitfield name="MASK15" caption="Peripheral Clock Enable Mask" mask="0x8000" values="CLKMSK__MASK" />
          <bitfield name="MASK16" caption="Peripheral Clock Enable Mask" mask="0x10000" values="CLKMSK__MASK" />
          <bitfield name="MASK17" caption="Peripheral Clock Enable Mask" mask="0x20000" values="CLKMSK__MASK" />
          <bitfield name="MASK18" caption="Peripheral Clock Enable Mask" mask="0x40000" values="CLKMSK__MASK" />
          <bitfield name="MASK19" caption="Peripheral Clock Enable Mask" mask="0x80000" values="CLKMSK__MASK" />
          <bitfield name="MASK20" caption="Peripheral Clock Enable Mask" mask="0x100000" values="CLKMSK__MASK" />
          <bitfield name="MASK21" caption="Peripheral Clock Enable Mask" mask="0x200000" values="CLKMSK__MASK" />
          <bitfield name="MASK22" caption="Peripheral Clock Enable Mask" mask="0x400000" values="CLKMSK__MASK" />
          <bitfield name="MASK23" caption="Peripheral Clock Enable Mask" mask="0x800000" values="CLKMSK__MASK" />
          <bitfield name="MASK24" caption="Peripheral Clock Enable Mask" mask="0x1000000" values="CLKMSK__MASK" />
          <bitfield name="MASK25" caption="Peripheral Clock Enable Mask" mask="0x2000000" values="CLKMSK__MASK" />
          <bitfield name="MASK26" caption="Peripheral Clock Enable Mask" mask="0x4000000" values="CLKMSK__MASK" />
          <bitfield name="MASK27" caption="Peripheral Clock Enable Mask" mask="0x8000000" values="CLKMSK__MASK" />
          <bitfield name="MASK28" caption="Peripheral Clock Enable Mask" mask="0x10000000" values="CLKMSK__MASK" />
          <bitfield name="MASK29" caption="Peripheral Clock Enable Mask" mask="0x20000000" values="CLKMSK__MASK" />
          <bitfield name="MASK30" caption="Peripheral Clock Enable Mask" mask="0x40000000" values="CLKMSK__MASK" />
          <bitfield name="MASK31" caption="Peripheral Clock Enable Mask" mask="0x80000000" values="CLKMSK__MASK" />
        </register>
      </register-group>
