zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00048.atdf
      <value-group name="INTENCLR__CKRDY">
        <value name="0" caption="The Clock Ready interrupt is disabled" value="0" />
        <value name="1" caption="The Clock Ready interrupt is enabled." value="1" />
      </value-group>
      <value-group name="INTENSET__CKRDY">
        <value name="0" caption="The Clock Ready interrupt is disabled." value="0" />
        <value name="1" caption="The Clock Ready interrupt is enabled." value="1" />
      </value-group>
      <value-group name="CLKDIV__DIV">
        <value name="DIV1" caption="Divide by 1" value="1" />
        <value name="DIV2" caption="Divide by 2" value="2" />
        <value name="DIV4" caption="Divide by 4" value="4" />
        <value name="DIV8" caption="Divide by 8" value="8" />
        <value name="DIV16" caption="Divide by 16" value="16" />
        <value name="DIV32" caption="Divide by 32" value="32" />
        <value name="DIV64" caption="Divide by 64" value="64" />
        <value name="DIV128" caption="Divide by 128" value="128" />
      </value-group>
      <value-group name="CLKMSK__MASK">
        <value name="0" caption="Peripheral clock mclk_clk_periph[n*32+x] stopped" value="0" />
        <value name="1" caption="Peripheral clock mclk_clk_periph[n*32+x] enabled" value="1" />
      </value-group>
    </module>
    <module name="MCRAMC" id="04921" name2="drm_mcramc_v5" version="5b0" caption="Multi-Channel RAM Controller">
      <register-group name="MCRAMC" caption="Multi-Channel RAM Controller">
        <register name="MCRAMC_CTRLA" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000002" caption="Control Enable A Register">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1" values="MCRAMC_CTRLA__SWRST" />
          <bitfield name="ENABLE" caption="ECC Decoder Enable" mask="0x2" values="MCRAMC_CTRLA__ENABLE" />
          <bitfield name="PRIV" caption="Priviledged Access Enable" mask="0x4" />
          <bitfield name="WS" caption="Wait State Enable" mask="0x100" />
        </register>
        <register name="MCRAMC_INTENCLR" offset="0x8" rw="RW" size="4" access-size="4" atomic-op="clear:MCRAMC_INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear Register">
          <bitfield name="SERREN" caption="Single Bit Error Interrupt Enable, Clear" mask="0x1" />
          <bitfield name="DERREN" caption="Double Bit Error Interrupt Enable, Clear" mask="0x2" />
        </register>
        <register name="MCRAMC_INTENSET" offset="0xC" rw="RW" size="4" access-size="4" atomic-op="set:MCRAMC_INTENSET" initval="0x00000000" caption="Interrupt Enable Set Register">
          <bitfield name="SERREN" caption="Single Bit Error Interrupt Enable, Set" mask="0x1" />
          <bitfield name="DERREN" caption="Double Bit Error Interrupt Enable, Set" mask="0x2" />
        </register>
        <register name="MCRAMC_INTSTA" offset="0x10" rw="RW" size="4" access-size="4" atomic-op="clear:MCRAMC_INTSTA" initval="0x00000000" caption="Interrupt Status Register">
          <bitfield name="SERR" caption="Single Bit Error" mask="0x1" />
          <bitfield name="DERR" caption="Double Bit Error" mask="0x2" />
        </register>
        <register name="MCRAMC_FLTCTRL" offset="0x14" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Fault Injection Control Register">
          <bitfield name="FLTEN" caption="Fault Injection Enabled" mask="0x2" values="MCRAMC_FLTCTRL__FLTEN" />
          <bitfield name="FLTMD" caption="Fault Injection Mode" mask="0x3000" />
        </register>
        <register name="MCRAMC_FLTPTR" offset="0x18" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Fault Injection Pointer Register">
          <bitfield name="FLT1PTR" caption="Single Fault Injection Bit Pointer" mask="0xFF" />
          <bitfield name="FLT2PTR" caption="Double Fault Injection Bit Pointer" mask="0xFF0000" />
        </register>
        <register name="MCRAMC_FLTADR" offset="0x1C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Fault Injection Address Register">
          <bitfield name="FLTADR" caption="Fault Address Offset" mask="0xFFFFFF" />
        </register>
        <register name="MCRAMC_ERRCADR" offset="0x20" rw="R" size="4" access-size="4" initval="0x00000000" caption="Error Capture Address Register">
          <bitfield name="ERCADR" caption="ECC SECDED Error Capture Address" mask="0xFFFFFF" />
        </register>
        <register name="MCRAMC_ERRCPAR" offset="0x24" rw="R" size="4" access-size="4" initval="0x00000000" caption="Error Capture Parity Register">
          <bitfield name="ERCPAR" caption="ECC SECDED Error Capture Parity" mask="0xFF" />
        </register>
        <register name="MCRAMC_ERRCSYN" offset="0x28" rw="R" size="4" access-size="4" initval="0x00000000" caption="Error Capture Syndrome Register">
          <bitfield name="ERCSYN" caption="ECC SECDED Error Capture Syndrome" mask="0xFF" values="MCRAMC_ERRCSYN__ERCSYN" />
          <bitfield name="ERR1" caption="ECC Single Bit Error" mask="0x4000" />
          <bitfield name="ERR2" caption="ECC Double Bit Error" mask="0x8000" values="MCRAMC_ERRCSYN__ERR2" />
        </register>
        <register name="MCRAMC_VERSION" offset="0xFC" rw="R" size="4" access-size="4" initval="0x00000510" caption="Version Register">
          <bitfield name="VERSION" caption="MCRAMC Version" mask="0xFFF" />
          <bitfield name="MFN" caption="Metal Fix Number" mask="0x70000" />
        </register>
      </register-group>
      <value-group name="MCRAMC_CTRLA__SWRST">
        <value name="0" caption="No effect." value="0" />
        <value name="1" caption="Reset the MCRAMC. A software-triggered hardware reset of the MCRAMC user interface is performed." value="1" />
      </value-group>
      <value-group name="MCRAMC_CTRLA__ENABLE">
        <value name="0" caption="ECC decoding is disabled." value="0" />
        <value name="1" caption="ECC decoding is enabled." value="1" />
      </value-group>
      <value-group name="MCRAMC_FLTCTRL__FLTEN">
        <value name="0" caption="Disables fault injection." value="0" />
        <value name="1" caption="Enables fault injection at FLTADR address offset as selected by FLTMD and FLTxPTR." value="1" />
      </value-group>
