zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00048.atdf
      <value-group name="MCRAMC_ERRCSYN__ERCSYN">
        <value name="0" caption="Not a Single bit error." value="0" />
        <value name="1" caption="Single bit error." value="1" />
      </value-group>
      <value-group name="MCRAMC_ERRCSYN__ERR2">
        <value name="0" caption="Not a Double bit error." value="0" />
        <value name="1" caption="Double bit error." value="1" />
      </value-group>
    </module>
    <module name="MPU" id="SYSTEM_IP" version="1.0.0" caption="Memory Protection Unit">
      <register-group name="MPU" caption="Memory Protection Unit">
        <register name="MPU_TYPE" offset="0x0" rw="R" size="4" access-size="4" caption="MPU Type Register">
          <bitfield name="SEPARATE" caption="Separate instructions and data address regions" mask="0x1" />
          <bitfield name="DREGION" caption="Number of MPU data regions" mask="0xFF00" />
        </register>
        <register name="MPU_CTRL" offset="0x4" rw="RW" size="4" access-size="4" caption="MPU Control Register">
          <bitfield name="ENABLE" caption="MPU enable" mask="0x1" />
          <bitfield name="HFNMIENA" caption="HardFault, NMI enable" mask="0x2" />
          <bitfield name="PRIVDEFENA" caption="Privileged default enable" mask="0x4" />
        </register>
        <register name="MPU_RNR" offset="0x8" rw="RW" size="4" access-size="4" caption="MPU Region Number Register">
          <bitfield name="REGION" caption="Selected region number" mask="0xFF" />
        </register>
        <register name="MPU_RBAR" offset="0xC" rw="RW" size="4" access-size="4" caption="MPU Region Base Address Register">
          <bitfield name="XN" caption="Execute Never" mask="0x1" />
          <bitfield name="AP" caption="Access permissions" mask="0x6" values="MPU_RBAR__AP" />
          <bitfield name="SH" caption="Shareability" mask="0x18" values="MPU_RBAR__SH" />
          <bitfield name="BASE" caption="Base address" mask="0xFFFFFFE0" />
        </register>
        <register name="MPU_RLAR" offset="0x10" rw="RW" size="4" access-size="4" caption="MPU Region Limit Address Register">
          <bitfield name="EN" caption="Region enable" mask="0x1" />
          <bitfield name="AttrInd" caption="Attribute Index" mask="0xE" />
          <bitfield name="LIMIT" caption="Limit address" mask="0xFFFFFFE0" />
        </register>
        <register name="MPU_MAIR0" offset="0x30" rw="RW" size="4" access-size="4" caption="MPU Memory Attribute Indirection Register 0">
          <bitfield name="Attr0" caption="Attribute of MPU region 0" mask="0xFF" />
          <bitfield name="Attr1" caption="Attribute of MPU region 1" mask="0xFF00" />
          <bitfield name="Attr2" caption="Attribute of MPU region 2" mask="0xFF0000" />
          <bitfield name="Attr3" caption="Attribute of MPU region 3" mask="0xFF000000" />
        </register>
        <register name="MPU_MAIR1" offset="0x34" rw="RW" size="4" access-size="4" caption="MPU Memory Attribute Indirection Register 1">
          <bitfield name="Attr4" caption="Attribute of MPU region 4" mask="0xFF" />
          <bitfield name="Attr5" caption="Attribute of MPU region 5" mask="0xFF00" />
          <bitfield name="Attr6" caption="Attribute of MPU region 6" mask="0xFF0000" />
          <bitfield name="Attr7" caption="Attribute of MPU region 7" mask="0xFF000000" />
        </register>
      </register-group>
      <value-group name="MPU_RBAR__AP">
        <value name="RWPRIV" caption="Read/write by privileged code only" value="0" />
        <value name="RWANY" caption="Read/write by any privilege level" value="1" />
        <value name="RPRIV" caption="Read-only by privileged code only" value="2" />
        <value name="RANY" caption="Read-only by any privilege level" value="3" />
      </value-group>
      <value-group name="MPU_RBAR__SH">
        <value name="NO" caption="Non-shareable" value="0" />
        <value name="OUTER" caption="Outer shareable" value="2" />
        <value name="INNER" caption="Inner shareable" value="3" />
      </value-group>
    </module>
    <module name="NVIC" id="SYSTEM_IP" version="1.0.0" caption="Nested Vectored Interrupt Controller">
      <register-group name="NVIC" caption="Nested Vectored Interrupt Controller">
        <register name="NVIC_ISER" offset="0x0" rw="RW" size="4" access-size="4" count="5" caption="Interrupt Set Enable Register n">
          <bitfield name="SETENA" caption="Set enable" mask="0xFFFFFFFF" />
        </register>
        <register name="NVIC_ICER" offset="0x80" rw="RW" size="4" access-size="4" count="5" caption="Interrupt Clear Enable Register n">
          <bitfield name="CLRENA" caption="Clear enable" mask="0xFFFFFFFF" />
        </register>
        <register name="NVIC_ISPR" offset="0x100" rw="RW" size="4" access-size="4" count="5" caption="Interrupt Set Pending Register n">
          <bitfield name="SETPEND" caption="Set pending" mask="0xFFFFFFFF" />
        </register>
        <register name="NVIC_ICPR" offset="0x180" rw="RW" size="4" access-size="4" count="5" caption="Interrupt Clear Pending Register n">
          <bitfield name="CLRPEND" caption="Clear pending" mask="0xFFFFFFFF" />
        </register>
        <register name="NVIC_IABR" offset="0x200" rw="R" size="4" access-size="4" count="5" caption="Interrupt Active Bit Register n">
          <bitfield name="ACTIVE" caption="Active state" mask="0xFFFFFFFF" />
        </register>
        <register name="NVIC_ITNS" offset="0x280" rw="RW" size="4" access-size="4" count="5" caption="Interrupt Target Non-secure Register n">
          <bitfield name="ITNS" caption="Interrupt Targets Non-secure" mask="0xFFFFFFFF" />
        </register>
        <register name="NVIC_IPR" offset="0x300" rw="RW" size="4" access-size="4" count="36" caption="Interrupt Priority Register n">
          <bitfield name="PRI_N0" caption="Priority of interrupt number 4n+0" mask="0xFF" />
          <bitfield name="PRI_N1" caption="Priority of interrupt number 4n+1" mask="0xFF00" />
          <bitfield name="PRI_N2" caption="Priority of interrupt number 4n+2" mask="0xFF0000" />
          <bitfield name="PRI_N3" caption="Priority of interrupt number 4n+3" mask="0xFF000000" />
        </register>
      </register-group>
    </module>
