zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00048.atdf
        <register name="QK_AR" offset="0x20C" rw="R" size="4" initval="0x00000000" caption="Allow register; The Allow register indicates which operations are currently allowed.">
          <bitfield name="qk_allow_enroll" caption="0: Enroll operation is not allowed 1: Enroll operation is allowed" mask="0x2" />
          <bitfield name="qk_allow_start" caption="0: Start operation is not allowed 1: Start operation is allowed" mask="0x4" />
          <bitfield name="qk_allow_reconstruct" caption="0: Reconstruct operation is not allowed 1: Reconstruct operation is allowed" mask="0x8" />
          <bitfield name="qk_allow_stop" caption="0: Stop operation is not allowed 1: Stop operation is allowed" mask="0x20" />
          <bitfield name="qk_allow_get_key" caption="0: Get Key operation is not allowed 1: Get Key operation is allowed" mask="0x40" />
          <bitfield name="qk_allow_unwrap" caption="0: Unwrap operation is not allowed 1: Unwrap operation is allowed" mask="0x80" />
          <bitfield name="qk_allow_wrap_generated_random" caption="0: Wrap Generated Random operation is not allowed 1: Wrap Generated Random operation is allowed" mask="0x100" />
          <bitfield name="qk_allow_wrap" caption="0: Wrap operation is not allowed 1: Wrap operation is allowed" mask="0x200" />
          <bitfield name="qk_allow_generate_random" caption="0: Generate Random operation is not allowed 1: Generate Random operation is allowed" mask="0x8000" />
          <bitfield name="qk_allow_test_memory" caption="0: Test Memory operation is not allowed 1: Test Memory operation is allowed" mask="0x40000000" />
          <bitfield name="qk_allow_test_puf" caption="0: Test PUF operation is not allowed 1: Test PUF operation is allowed" mask="0x80000000" />
        </register>
        <register name="QK_IER" offset="0x210" rw="RW" size="4" atomic-op="set:QK_IMR" initval="0x00000000" caption="Interrupt Enable register; With the Interrupt Enable register all QuiddiKey interrupts can be enabled or disabled, without changing the Interrupt Mask register.">
          <bitfield name="qk_int_en" caption="0: Disables all QuiddiKey interrupts 1: Enables all QuiddiKey interrupts that are enabled in the Interrupt Mask register" mask="0x1" />
        </register>
        <register name="QK_IMR" offset="0x214" rw="RW" size="4" initval="0x00000000" caption="Interrupt Mask register; Individual QuiddiKey interrupts can be enabled or disabled with the Interrupt Mask register.">
          <bitfield name="qk_int_en_busy" caption="Enables the busy interrupt" mask="0x1" />
          <bitfield name="qk_int_en_ok" caption="Enables the ok interrupt" mask="0x2" />
          <bitfield name="qk_int_en_error" caption="Enables the error interrupt" mask="0x4" />
          <bitfield name="qk_int_en_zeroized" caption="Enables the zeroized interrupt" mask="0x8" />
          <bitfield name="qk_int_en_rejected" caption="Enables the rejected interrupt" mask="0x10" />
          <bitfield name="qk_int_en_di_request" caption="Enables the data in request interrupt" mask="0x20" />
          <bitfield name="qk_int_en_do_request" caption="Enables the data out request interrupt" mask="0x40" />
        </register>
        <register name="QK_ISR" offset="0x218" rw="RW" size="4" initval="0x00000000" caption="Interrupt Status register; The Interrupt Status register indicates which interrupt has occurred. Multiple interrupts may occur at the same time (e.g. the busy interrupt occurs together with one of the ok and error interrupts). Writing 1 to a bit, clears the corresponding bit.">
          <bitfield name="qk_int_busy" caption="A negative edge has occurred on qk_busy, which means that an operation has completed" mask="0x1" />
          <bitfield name="qk_int_ok" caption="A positive edge has occurred on qk_ok, which means that an operation successfully completed" mask="0x2" />
          <bitfield name="qk_int_error" caption="A positive edge has occurred on qk_error, which means that an operation has failed" mask="0x4" />
          <bitfield name="qk_int_zeroized" caption="A positive edge has occurred on qk_zeroized, which means that QuiddiKey has moved to the Zeroized or Locked state" mask="0x8" />
          <bitfield name="qk_int_rejected" caption="A positive edge has occurred on qk_rejected, which means that a command was rejected" mask="0x10" />
          <bitfield name="qk_int_di_request" caption="A positive edge has occurred on qk_di_request, which means that a data in transfer is requested via the QK_DIR register" mask="0x20" />
          <bitfield name="qk_int_do_request" caption="A positive edge has occurred on qk_do_request, which means that a data out transfer is requested via the QK_DOR register" mask="0x40" />
        </register>
        <register name="QK_DATA_DEST" offset="0x220" rw="RW" size="4" initval="0x00000000" caption="Data Destination register; The Data Destination register defines via which interface data is made available by QuiddiKey. Only one bit at a time may be 1.">
          <bitfield name="qk_dest_dor" caption="Data will be made available via the QK_DOR register" mask="0x1" />
          <bitfield name="qk_dest_so" caption="Data will be made available via the SO interface" mask="0x2" />
        </register>
        <register name="QK_DATA_SRC" offset="0x224" rw="RW" size="4" initval="0x00000000" caption="Data Source register; The Data Source register defines via which interface data must be provided to QuiddiKey. Combinations of bits may be 1 at a time.">
          <bitfield name="qk_src_dir" caption="Data must be provided via the QK_DIR register" mask="0x1" />
          <bitfield name="qk_src_si" caption="Data must be provided via the SI interface" mask="0x2" />
        </register>
        <register name="QK_KEY_INDEX" offset="0x228" rw="R" size="4" initval="0x00000000" caption="Key Index register; The Key Index register provides the index of the key that is currently output.">
          <bitfield name="qk_key_inde" caption="Value of the Key Index" mask="0xF" />
        </register>
        <register name="QK_DIR" offset="0x2A0" rw="W" size="4" initval="0x00000000" caption="Data Input register; The Data Input register is used to transfer data to QuiddiKey. It can only be written when input data is requested (indicated by the qk_di_request signal). When written at any other moment, or when read, an error response is generated. Depending on the way the system is configured and connected, this may generate an exception.">
          <bitfield name="qk_di" caption="Input data to QuiddiKey" mask="0xFFFFFFFF" />
        </register>
