zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00048.atdf
        <register name="QK_DOR" offset="0x2A8" rw="R" size="4" initval="0x00000000" caption="Data Output register; The Data Output register is used to transfer data from QuiddiKey. It can only be read when input data is available (indicated by the qk_do_request signal). When read at any other moment, or when written, an error response is generated. Depending on the way the system is configured and connected, this may generate an exception.">
          <bitfield name="qk_do" caption="Output data from QuiddiKey" mask="0xFFFFFFFF" />
        </register>
        <register name="QK_MISC" offset="0x2C0" rw="RW" size="4" initval="0x00000001" caption="Miscellaneous register; The Miscellaneous register defines miscellaneous settings for QuiddiKey. These usually need to be configured only once after power up orreset.">
          <bitfield name="qk_data_endianness" caption="Defines the endianness of data in QK_DIR and QK_DOR: 0: Little endian 1: Big endian (default)" mask="0x1" />
        </register>
        <register name="QK_IF_SR" offset="0x2D0" rw="RW" size="4" initval="0x00000000" caption="Interface Status register; The status of the interface can be monitored with the Interface Status register. Writing 1 to a bit, clears the corresponding bit.">
          <bitfield name="reg_if_error" caption="An error has occurred at the register interface" mask="0x1" />
        </register>
        <register name="QK_TEST" offset="0x2D8" rw="RW" size="4" initval="0x00000000" caption="Test register; With the Test register a BIST can be started. It also shows the result of the last BIST.">
          <bitfield name="qk_bist_enable" caption="Isolates QuiddiKey and runs BIST" mask="0x1" />
          <bitfield name="qk_bist_running" caption="BIST is in progress or finishing up (after qk_bist_enable = 0)" mask="0x10" />
          <bitfield name="qk_bist_active" caption="BIST is in progress" mask="0x20" />
          <bitfield name="qk_bist_ok" caption="BIST has passed" mask="0x40" />
          <bitfield name="qk_bist_error" caption="BIST has failed" mask="0x80" />
          <bitfield name="qk_allow_bist" caption="BIST is not allowed" mask="0x80000000" />
        </register>
        <register name="QK_PSR" offset="0x2DC" rw="R" size="4" initval="0x0000000F" caption="PUF Score register; The PUF Score register shows the value of the PUF Score that was obtained during the last Test PUF, Enroll, Start or Reconstruct operation.">
          <bitfield name="qk_puf_score" caption="PUF score obtained during the last Test PUF, Enroll, Start or Reconstruct operation" mask="0xF" />
        </register>
        <register name="QK_HW_RUC0" offset="0x2E0" rw="R" size="4" initval="0x00000000" caption="Module Restrict User Context 0 register; The Module Restrict User Context 0 register shows the values of the qk_restrict_user_context_0 signal on the signal interface.">
          <bitfield name="qk_restrict_user_context_0" caption="For each bit in the User_Context_0 field: 0: This bit can be used 1: This bit cannot be used" mask="0xFFFFFFFF" />
        </register>
        <register name="QK_HW_RUC1" offset="0x2E4" rw="R" size="4" initval="0x00000000" caption="Module Restrict User Context 1 register; The Module Restrict User Context 1 register shows the values of the qk_restrict_user_context_1 signal on the signal interface.">
          <bitfield name="qk_restrict_user_context_1" caption="For each bit in the User_Context_1 field: 0: This bit can be used 1: This bit cannot be used" mask="0xFFFFFFFF" />
        </register>
        <register name="QK_HW_SETTINGS" offset="0x2F0" rw="R" size="4" initval="0x00000000" caption="Module Settings register; The Module Settings register shows the values of the module settings on the signal interface.">
          <bitfield name="qk_disable_enroll" caption="0: Enroll operations are enabled 1: Enroll operations are disabled" mask="0x2" />
          <bitfield name="qk_disable_start" caption="0: Start operations are enabled 1: Start operations are disabled" mask="0x4" />
          <bitfield name="qk_disable_reconstruct" caption="0: Reconstruct operations are enabled 1: Reconstruct operations are disabled" mask="0x8" />
          <bitfield name="qk_disable_stop" caption="0: Stop operations are enabled 1: Stop operations are disabled" mask="0x20" />
          <bitfield name="qk_disable_get_key" caption="0: Get Key operations are enabled 1: Get Key operations are disabled" mask="0x40" />
          <bitfield name="qk_disable_unwrap" caption="0: Unwrap operations are enabled 1: Unwrap operations are disabled" mask="0x80" />
          <bitfield name="qk_disable_wrap_generated_random" caption="0: Wrap Generated Random operations are enabled 1: Wrap Generated Random operations are disabled" mask="0x100" />
          <bitfield name="qk_disable_wrap" caption="0: Wrap operations are enabled 1: Wrap operations are disabled" mask="0x200" />
          <bitfield name="qk_disable_generate_random" caption="0: Generate Random operations are enabled 1: Generate Random operations are disabled" mask="0x8000" />
          <bitfield name="qk_skip_memory_test" caption="0: Includes memory test during initialization 1: Skips memory test during initialization" mask="0x20000000" />
          <bitfield name="qk_disable_test_memory" caption="0: Test Memory operations are enabled 1: Test Memory operations are disabled" mask="0x40000000" />
          <bitfield name="qk_disable_test_puf" caption="0: Test PUF operations are enabled 1: Test PUF operations are disabled" mask="0x80000000" />
        </register>
        <register name="QK_HW_INFO" offset="0x2F4" rw="R" size="4" initval="0x21400000" caption="Module Information register; The Module Information register indicates which configuration of QuiddiKey is used for this module and which options it includes.">
          <bitfield name="qk_config_sp_800_90" caption="1: SP 800-90 option is included 0: SP 800-90 option is not included" mask="0x200000" />
          <bitfield name="qk_config_bist" caption="1: BIST is included 0: BIST is not included" mask="0x400000" />
          <bitfield name="Reserved" caption="Safe: 1 Plus: 0" mask="0x800000" />
          <bitfield name="qk_config_wrap" caption="1: Wrap is included 0: Wrap is not included" mask="0x1000000" />
          <bitfield name="qk_config_type" caption="QuiddiKey configuration" mask="0xF0000000" values="QK_HW_INFO__qk_config_type" />
        </register>
        <register name="QK_HW_ID" offset="0x2F8" rw="R" size="4" initval="0x20120702" caption="Module Identifier register; The Module Identifier register provides the identifier of the QuiddiKey Engine netlist.">
          <bitfield name="qk_hw_id" caption="Module identifier" mask="0xFFFFFFFF" />
        </register>
        <register name="QK_HW_VER" offset="0x2FC" rw="R" size="4" initval="0x00030701" caption="Module Version register; The Module Version register provides the version of this module: major.minor.patch.">
          <bitfield name="qk_hw_rev" caption="Module version, patch part" mask="0xFF" />
          <bitfield name="qk_hw_version_minor" caption="Module version, minor part" mask="0xFF00" />
          <bitfield name="qk_hw_version_major" caption="Module version, major part" mask="0xFF0000" />
        </register>
      </register-group>
