zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00048.atdf
      <value-group name="TAMPCTRL__IN2ACT">
        <value name="OFF" caption="Off (Disabled)" value="0x0" />
        <value name="WAKE" caption="Wake and set Tamper flag" value="0x1" />
        <value name="CAPTURE" caption="Capture timestamp and set Tamper flag" value="0x2" />
        <value name="ACTL" caption="Compare IN2 to OUT. When a mismatch occurs, capture timestamp and set Tamper flag" value="0x3" />
      </value-group>
      <value-group name="TAMPCTRL__IN3ACT">
        <value name="OFF" caption="Off (Disabled)" value="0x0" />
        <value name="WAKE" caption="Wake and set Tamper flag" value="0x1" />
        <value name="CAPTURE" caption="Capture timestamp and set Tamper flag" value="0x2" />
        <value name="ACTL" caption="Compare IN3 to OUT. When a mismatch occurs, capture timestamp and set Tamper flag" value="0x3" />
      </value-group>
      <value-group name="TAMPCTRL__IN4ACT">
        <value name="OFF" caption="Off (Disabled)" value="0x0" />
        <value name="WAKE" caption="Wake and set Tamper flag" value="0x1" />
        <value name="CAPTURE" caption="Capture timestamp and set Tamper flag" value="0x2" />
        <value name="ACTL" caption="Compare IN4 to OUT. When a mismatch occurs, capture timestamp and set Tamper flag" value="0x3" />
      </value-group>
      <value-group name="TAMPCTRL__IN5ACT">
        <value name="OFF" caption="Off (Disabled)" value="0x0" />
        <value name="WAKE" caption="Wake and set Tamper flag" value="0x1" />
        <value name="CAPTURE" caption="Capture timestamp and set Tamper flag" value="0x2" />
        <value name="ACTL" caption="Compare IN5 to OUT. When a mismatch occurs, capture timestamp and set Tamper flag" value="0x3" />
      </value-group>
      <value-group name="TAMPCTRL__IN6ACT">
        <value name="OFF" caption="Off (Disabled)" value="0x0" />
        <value name="WAKE" caption="Wake and set Tamper flag" value="0x1" />
        <value name="CAPTURE" caption="Capture timestamp and set Tamper flag" value="0x2" />
        <value name="ACTL" caption="Compare IN6 to OUT. When a mismatch occurs, capture timestamp and set Tamper flag" value="0x3" />
      </value-group>
      <value-group name="TAMPCTRL__IN7ACT">
        <value name="OFF" caption="Off (Disabled)" value="0x0" />
        <value name="WAKE" caption="Wake and set Tamper flag" value="0x1" />
        <value name="CAPTURE" caption="Capture timestamp and set Tamper flag" value="0x2" />
        <value name="ACTL" caption="Compare IN7 to OUT. When a mismatch occurs, capture timestamp and set Tamper flag" value="0x3" />
      </value-group>
    </module>
    <module name="SAU" id="SYSTEM_IP" version="1.0.0" caption="Security Attribution Unit">
      <register-group name="SAU" caption="Security Attribution Unit">
        <register name="SAU_CTRL" offset="0x0" rw="RW" size="4" access-size="4" caption="SAU Control Register">
          <bitfield name="ENABLE" caption="SAU enable" mask="0x1" />
          <bitfield name="ALLNS" caption="All Non-secure" mask="0x2" />
        </register>
        <register name="SAU_TYPE" offset="0x4" rw="R" size="4" access-size="4" caption="SAU Type Register">
          <bitfield name="SREGION" caption="Number of SAU regions" mask="0xFF" />
        </register>
        <register name="SAU_RNR" offset="0x8" rw="RW" size="4" access-size="4" caption="SAU Region Number Register">
          <bitfield name="REGION" caption="Selected SAU region number" mask="0xFF" />
        </register>
        <register name="SAU_RBAR" offset="0xC" rw="RW" size="4" access-size="4" caption="SAU Region Base Address Register">
          <bitfield name="BADDR" caption="Base address" mask="0xFFFFFFE0" />
        </register>
        <register name="SAU_RLAR" offset="0x10" rw="RW" size="4" access-size="4" caption="SAU Region Limit Address Register">
          <bitfield name="ENABLE" caption="SAU region enable" mask="0x1" />
          <bitfield name="NSC" caption="Non-secure callable region" mask="0x2" />
          <bitfield name="LADDR" caption="Limit address" mask="0xFFFFFFE0" />
        </register>
      </register-group>
    </module>
    <module name="SCB" id="SYSTEM_IP" version="1.0.0" caption="System Control Block">
      <register-group name="SCB" caption="System Control Block">
        <register name="CPUID" offset="0x0" rw="R" size="4" access-size="4" caption="CPUID base register">
          <bitfield name="Revision" caption="Revision number" mask="0xF" />
          <bitfield name="PartNo" caption="Part number, 0xD20=Cortex-M23" mask="0xFFF0" />
          <bitfield name="Architecture" caption="Architecture version, 0xC=ARMv8-M Base Line, 0xF=ARMv8-M Main Line" mask="0xF0000" />
          <bitfield name="Variant" caption="Variant number" mask="0xF00000" />
          <bitfield name="Implementer" caption="Implementer code, ARM=0x41" mask="0xFF000000" />
        </register>
        <register name="ICSR" offset="0x4" rw="RW" size="4" access-size="4" caption="Interrupt Control and State Register">
          <bitfield name="VECTACTIVE" caption="Vector active" mask="0x1FF" />
          <bitfield name="RETTOBASE" caption="Return to base" mask="0x800" />
          <bitfield name="VECTPENDING" caption="Vector pending" mask="0x1FF000" />
          <bitfield name="ISRPENDING" caption="Interrupt pending" mask="0x400000" />
          <bitfield name="ISRPREEMPT" caption="Interrupt preempt" mask="0x800000" />
          <bitfield name="PENDSTCLR" caption="Pend SysTick clear" mask="0x2000000" values="ICSR__PENDSTCLR" />
          <bitfield name="PENDSTSET" caption="Pend SysTick set" mask="0x4000000" values="ICSR__PENDSTSET" />
          <bitfield name="PENDSVCLR" caption="Pend PendSV clear" mask="0x8000000" values="ICSR__PENDSVCLR" />
          <bitfield name="PENDSVSET" caption="Pend PendSV set" mask="0x10000000" values="ICSR__PENDSVSET" />
          <bitfield name="PENDNMICLR" caption="Pend NMI clear" mask="0x40000000" />
          <bitfield name="PENDNMISET" caption="Pend NMI set" mask="0x80000000" values="ICSR__PENDNMISET" />
        </register>
        <register name="VTOR" offset="0x8" rw="RW" size="4" access-size="4" caption="Vector Table Offset Register">
          <bitfield name="TBLOFF" caption="Vector table base offset" mask="0xFFFFFF80" />
        </register>
        <register name="AIRCR" offset="0xC" rw="RW" size="4" access-size="4" caption="Application Interrupt and Reset Control Register">
          <bitfield name="VECTCLRACTIVE" caption="Debug: Clear Active State" mask="0x2" values="AIRCR__VECTCLRACTIVE" />
          <bitfield name="SYSRESETREQ" caption="System Reset Request" mask="0x4" values="AIRCR__SYSRESETREQ" />
          <bitfield name="SYSRESETREQS" caption="System Reset Request Secure only" mask="0x8" values="AIRCR__SYSRESETREQS" />
          <bitfield name="BFHFNMINS" caption="BusFault, HardFault and NMI Non-secure enable" mask="0x2000" values="AIRCR__BFHFNMINS" />
          <bitfield name="PRIS" caption="Prioritize Secure Exceptions" mask="0x4000" values="AIRCR__PRIS" />
          <bitfield name="ENDIANNESS" caption="Data Endianness, 0=little, 1=big" mask="0x8000" values="AIRCR__ENDIANNESS" />
          <bitfield name="VECTKEY" caption="Register Key (0x05FA)" mask="0xFFFF0000" />
        </register>
        <register name="SCR" offset="0x10" rw="RW" size="4" access-size="4" caption="System Control Register">
          <bitfield name="SLEEPONEXIT" caption="Sleep on exit" mask="0x2" values="SCR__SLEEPONEXIT" />
          <bitfield name="SLEEPDEEP" caption="Sleep deep" mask="0x4" values="SCR__SLEEPDEEP" />
          <bitfield name="SLEEPDEEPS" caption="Sleep deep secure" mask="0x8" />
          <bitfield name="SEVONPEND" caption="Send Event on Pending bit" mask="0x10" values="SCR__SEVONPEND" />
        </register>
        <register name="CCR" offset="0x14" rw="RW" size="4" access-size="4" caption="Configuration and Control Register">
          <bitfield name="USERSETMPEND" caption="User set main pending" mask="0x2" />
          <bitfield name="UNALIGN_TRP" caption="Unaligned trap" mask="0x8" values="CCR__UNALIGN_TRP" />
          <bitfield name="DIV_0_TRP" caption="Divide by zero trap" mask="0x10" />
          <bitfield name="BFHFNMIGN" caption="BusFault in HardFault or NMI ignore" mask="0x100" />
          <bitfield name="STKOFHFNMIGN" caption="Stack overflow in HardFault and NMI ignore" mask="0x400" />
          <bitfield name="DC" caption="Data cache enable" mask="0x10000" />
          <bitfield name="IC" caption="Instruction cache enable" mask="0x20000" />
          <bitfield name="BP" caption="Branch prediction enable" mask="0x40000" />
        </register>
        <register name="SHPR2" offset="0x1C" rw="RW" size="4" access-size="4" caption="System Handler Priority Register 2">
          <bitfield name="PRI_11" caption="Priority of system handler 11, SVCall" mask="0xFF000000" />
        </register>
