zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00048.atdf
        <register modes="SPI" name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="SPI Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1" />
          <bitfield name="ENABLE" caption="Enable" mask="0x2" />
          <bitfield name="MODE" caption="Operating Mode" mask="0x1C" values="SPI_CTRLA__MODE" />
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x80" />
          <bitfield name="IBON" caption="Immediate Buffer Overflow Notification" mask="0x100" />
          <bitfield name="DOPO" caption="Data Out Pinout" mask="0x30000" values="SPI_CTRLA__DOPO" />
          <bitfield name="DIPO" caption="Data In Pinout" mask="0x300000" values="SPI_CTRLA__DIPO" />
          <bitfield name="FORM" caption="Frame Format" mask="0xF000000" values="SPI_CTRLA__FORM" />
          <bitfield name="CPHA" caption="Clock Phase" mask="0x10000000" values="SPI_CTRLA__CPHA" />
          <bitfield name="CPOL" caption="Clock Polarity" mask="0x20000000" values="SPI_CTRLA__CPOL" />
          <bitfield name="DORD" caption="Data Order" mask="0x40000000" values="SPI_CTRLA__DORD" />
        </register>
        <register modes="USART" name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="USART Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1" />
          <bitfield name="ENABLE" caption="Enable" mask="0x2" />
          <bitfield name="MODE" caption="Operating Mode" mask="0x1C" values="USART_CTRLA__MODE" />
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x80" />
          <bitfield name="IBON" caption="Immediate Buffer Overflow Notification" mask="0x100" />
          <bitfield name="TXINV" caption="Transmit Data Invert" mask="0x200" values="USART_CTRLA__TXINV" />
          <bitfield name="RXINV" caption="Receive Data Invert" mask="0x400" values="USART_CTRLA__RXINV" />
          <bitfield name="SAMPR" caption="Sample" mask="0xE000" values="USART_CTRLA__SAMPR" />
          <bitfield name="TXPO" caption="Transmit Data Pinout" mask="0x30000" values="USART_CTRLA__TXPO" />
          <bitfield name="RXPO" caption="Receive Data Pinout" mask="0x300000" values="USART_CTRLA__RXPO" />
          <bitfield name="SAMPA" caption="Sample Adjustment" mask="0xC00000" />
          <bitfield name="FORM" caption="Frame Format" mask="0xF000000" values="USART_CTRLA__FORM" />
          <bitfield name="CMODE" caption="Communication Mode" mask="0x10000000" values="USART_CTRLA__CMODE" />
          <bitfield name="CPOL" caption="Clock Polarity" mask="0x20000000" />
          <bitfield name="DORD" caption="Data Order" mask="0x40000000" values="USART_CTRLA__DORD" />
        </register>
        <register modes="I2CM" name="CTRLB" offset="0x4" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="I2CM Control B">
          <bitfield name="SMEN" caption="Smart Mode Enable" mask="0x100" />
          <bitfield name="QCEN" caption="Quick Command Enable" mask="0x200" />
          <bitfield name="CMD" caption="Command" mask="0x30000" />
          <bitfield name="ACKACT" caption="Acknowledge Action" mask="0x40000" />
          <bitfield name="FIFOCLR" caption="FIFO Clear" mask="0xC00000" values="I2CM_CTRLB__FIFOCLR" />
        </register>
        <register modes="I2CS" name="CTRLB" offset="0x4" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="I2CS Control B">
          <bitfield name="SMEN" caption="Smart Mode Enable" mask="0x100" />
          <bitfield name="GCMD" caption="PMBus Group Command" mask="0x200" />
          <bitfield name="AACKEN" caption="Automatic Address Acknowledge" mask="0x400" />
          <bitfield name="AMODE" caption="Address Mode" mask="0xC000" values="I2CS_CTRLB__AMODE" />
          <bitfield name="CMD" caption="Command" mask="0x30000" />
          <bitfield name="ACKACT" caption="Acknowledge Action" mask="0x40000" />
          <bitfield name="FIFOCLR" caption="FIFO Clear" mask="0xC00000" values="I2CS_CTRLB__FIFOCLR" />
        </register>
        <register modes="SPI" name="CTRLB" offset="0x4" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="SPI Control B">
          <bitfield name="CHSIZE" caption="Character Size" mask="0x7" values="SPI_CTRLB__CHSIZE" />
          <bitfield name="PLOADEN" caption="Data Preload Enable" mask="0x40" />
          <bitfield name="SSDE" caption="Slave Select Low Detect Enable" mask="0x200" values="SPI_CTRLB__SSDE" />
          <bitfield name="MSSEN" caption="Master Slave Select Enable" mask="0x2000" values="SPI_CTRLB__MSSEN" />
          <bitfield name="AMODE" caption="Address Mode" mask="0xC000" values="SPI_CTRLB__AMODE" />
          <bitfield name="RXEN" caption="Receiver Enable" mask="0x20000" />
          <bitfield name="FIFOCLR" caption="FIFO Clear" mask="0xC00000" values="SPI_CTRLB__FIFOCLR" />
        </register>
        <register modes="USART" name="CTRLB" offset="0x4" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="USART Control B">
          <bitfield name="CHSIZE" caption="Character Size" mask="0x7" values="USART_CTRLB__CHSIZE" />
          <bitfield name="SBMODE" caption="Stop Bit Mode" mask="0x40" values="USART_CTRLB__SBMODE" />
          <bitfield name="COLDEN" caption="Collision Detection Enable" mask="0x100" />
          <bitfield name="SFDE" caption="Start of Frame Detection Enable" mask="0x200" />
          <bitfield name="ENC" caption="Encoding Format" mask="0x400" values="USART_CTRLB__ENC" />
          <bitfield name="PMODE" caption="Parity Mode" mask="0x2000" values="USART_CTRLB__PMODE" />
          <bitfield name="TXEN" caption="Transmitter Enable" mask="0x10000" />
          <bitfield name="RXEN" caption="Receiver Enable" mask="0x20000" />
          <bitfield name="FIFOCLR" caption="FIFO Clear" mask="0xC00000" values="USART_CTRLB__FIFOCLR" />
          <bitfield name="LINCMD" caption="LIN Command" mask="0x3000000" values="USART_CTRLB__LINCMD" />
        </register>
        <register modes="I2CM" name="CTRLC" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="I2CM Control C">
          <bitfield name="DATA32B" caption="Data 32 Bit" mask="0x1000000" />
          <bitfield name="FIFOEN" caption="FIFO Enable" mask="0x8000000" />
          <bitfield name="RXTRHOLD" caption="Receive FIFO Threshold" mask="0x30000000" values="I2CM_CTRLC__RXTRHOLD" />
          <bitfield name="TXTRHOLD" caption="Transmit FIFO Threshold" mask="0xC0000000" values="I2CM_CTRLC__TXTRHOLD" />
        </register>
        <register modes="I2CS" name="CTRLC" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="I2CS Control C">
          <bitfield name="SDASETUP" caption="SDA Setup Time" mask="0xF" />
          <bitfield name="DATA32B" caption="Data 32 Bit" mask="0x1000000" />
          <bitfield name="FIFOEN" caption="FIFO Enable" mask="0x8000000" />
          <bitfield name="RXTRHOLD" caption="Receive FIFO Threshold" mask="0x30000000" values="I2CS_CTRLC__RXTRHOLD" />
          <bitfield name="TXTRHOLD" caption="Transmit FIFO Threshold" mask="0xC0000000" values="I2CS_CTRLC__TXTRHOLD" />
        </register>
        <register modes="SPI" name="CTRLC" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="SPI Control C">
          <bitfield name="ICSPACE" caption="Inter-Character Spacing" mask="0x3F" />
          <bitfield name="FSES" caption="Frame Synch Edge Select" mask="0x100" />
          <bitfield name="FSLEN" caption="Frame Synch Length" mask="0x200" values="SPI_CTRLC__FSLEN" />
          <bitfield name="FSPOL" caption="Frame Synch Polarity" mask="0x400" values="SPI_CTRLC__FSPOL" />
          <bitfield name="IGNTUR" caption="Ignore Transmit Underrun" mask="0x800" />
          <bitfield name="FRMEN" caption="Frame mode enable" mask="0x10000" />
          <bitfield name="FMODE" caption="Frame mode" mask="0x20000" values="SPI_CTRLC__FMODE" />
          <bitfield name="DATA32B" caption="Data 32 Bit" mask="0x1000000" />
          <bitfield name="FIFOEN" caption="FIFO Enable" mask="0x8000000" />
          <bitfield name="RXTRHOLD" caption="Receive FIFO Threshold" mask="0x30000000" values="SPI_CTRLC__RXTRHOLD" />
          <bitfield name="TXTRHOLD" caption="Transmit FIFO Threshold" mask="0xC0000000" values="SPI_CTRLC__TXTRHOLD" />
        </register>
        <register modes="USART" name="CTRLC" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="USART Control C">
          <bitfield name="GTIME" caption="Guard Time" mask="0x7" />
          <bitfield name="BRKLEN" caption="LIN Master Break Length" mask="0x300" values="USART_CTRLC__BRKLEN" />
          <bitfield name="HDRDLY" caption="LIN Master Header Delay" mask="0xC00" values="USART_CTRLC__HDRDLY" />
          <bitfield name="INACK" caption="Inhibit Not Acknowledge" mask="0x10000" />
          <bitfield name="DSNACK" caption="Disable Successive NACK" mask="0x20000" />
          <bitfield name="MAXITER" caption="Maximum Iterations" mask="0x700000" />
          <bitfield name="DATA32B" caption="Data 32 Bit" mask="0x3000000" />
          <bitfield name="FIFOEN" caption="FIFO Enable" mask="0x8000000" />
          <bitfield name="RXTRHOLD" caption="Receive FIFO Threshold" mask="0x30000000" values="USART_CTRLC__RXTRHOLD" />
          <bitfield name="TXTRHOLD" caption="Transmit FIFO Threshold" mask="0xC0000000" values="USART_CTRLC__TXTRHOLD" />
        </register>
        <register modes="I2CM" name="BAUD" offset="0xC" rw="RW" size="4" initval="0x00000000" caption="I2CM Baud Rate">
          <bitfield name="BAUD" caption="Baud Rate Value" mask="0xFF" />
          <bitfield name="BAUDLOW" caption="Baud Rate Value Low" mask="0xFF00" />
          <bitfield name="HSBAUD" caption="High Speed Baud Rate Value" mask="0xFF0000" />
          <bitfield name="HSBAUDLOW" caption="High Speed Baud Rate Value Low" mask="0xFF000000" />
        </register>
        <register modes="SPI" name="BAUD" offset="0xC" rw="RW" size="1" initval="0x00" caption="SPI Baud Rate">
          <bitfield name="BAUD" caption="Baud Rate Value" mask="0xFF" />
        </register>
        <register modes="USART" name="BAUD" offset="0xC" rw="RW" size="2" initval="0x0000" caption="USART Baud Rate">
          <mode name="DEFAULT" qualifier="SERCOM.USART.CTRLA.FORM" value="0" caption="Default" />
          <mode name="FRAC" qualifier="SERCOM.USART.CTRLA.FORM" value="4" caption="Fractional Baud mode" />
          <mode name="FRACFP" qualifier="SERCOM.USART.CTRLA.FORM" value="5" caption="Fractional Baud with Parity mode" />
          <mode name="USARTFP" qualifier="SERCOM.USART.CTRLA.FORM" value="1" caption="USART Frame with Parity mode" />
          <bitfield modes="FRAC FRACFP" name="BAUD" caption="Baud Rate Value" mask="0x1FFF" />
          <bitfield modes="FRAC FRACFP" name="FP" caption="Fractional Part" mask="0xE000" />
          <bitfield modes="DEFAULT USARTFP" name="BAUD" caption="Baud Rate Value" mask="0xFFFF" />
        </register>
