zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00048.atdf
        <register name="BKIN" offset="0x2C" rw="R" size="4" initval="0x00000000" caption="Backup Input Control">
          <bitfield name="BKIN" caption="Backup Input Value" mask="0x3" />
        </register>
      </register-group>
      <value-group name="BOR__DCBORPSEL">
        <value name="NODIV" caption="Not Divided" value="0x0" />
        <value name="DIV2" caption="Divide clock by 2" value="0x1" />
        <value name="DIV4" caption="Divide clock by 4" value="0x2" />
        <value name="DIV8" caption="Divide clock by 8" value="0x3" />
        <value name="DIV16" caption="Divide clock by 16" value="0x4" />
        <value name="DIV32" caption="Divide clock by 32" value="0x5" />
        <value name="DIV64" caption="Divide clock by 64" value="0x6" />
        <value name="DIV128" caption="Divide clock by 128" value="0x7" />
      </value-group>
      <value-group name="BOR__BORFILT">
        <value name="NOFILT" caption="No digital filtering" value="0x0" />
        <value name="FILT32US" caption="32us filtering" value="0x1" />
        <value name="FILT125US" caption="125us filtering" value="0x2" />
        <value name="FILT250US" caption="250us filtering" value="0x3" />
      </value-group>
      <value-group name="LVD__DIR">
        <value name="rising" caption="Rising detection" value="0x0" />
        <value name="falling" caption="Falling detection" value="0x1" />
      </value-group>
      <value-group name="VREGCTRL__VREGOUT">
        <value name="1p2v" caption="In Active mode, VDDCORE_RAM, VDDCORE_BU, VDDCORE_SW and optionnaly VDDCORE_PLL USB are set to 1.2v." value="0x0" />
        <value name="1p0v" caption="In Active mode, VDDCORE_RAM, VDDCORE_BU, VDDCORE_SW and optionnaly VDDCORE_PLL USB are set to 1.0v." value="0x1" />
        <value name="0p8v" caption="In Active mode, VDDCORE_RAM, VDDCORE_BU, VDDCORE_SW and optionnaly VDDCORE_PLL USB are set to 0.8v." value="0x2" />
      </value-group>
      <value-group name="VREGCTRL__OFFSTDBY">
        <value name="OFF" caption="In standby mode, VREGSW1,2,3 are OFF" value="0x0" />
        <value name="ON" caption="In standby mode, VREGSW1,2,3 are ON" value="0x1" />
      </value-group>
      <value-group name="VREGCTRL__LVSTDBY">
        <value name="1p2v" caption="In standby mode, VDDCORE_BU, VDDCORE_RAM, VDDCORE_SW and optionnaly VDDCOREUSB/PLL are set to 1.2v." value="0x0" />
        <value name="0p8v" caption="In standby mode, VDDCORE_BU, VDDCORE_RAM, VDDCORE_SW and optionnaly VDDCOREUSB/PLL are set to 0.8v." value="0x1" />
      </value-group>
      <value-group name="VREGCTRL__LVHIB">
        <value name="1p2v" caption="In Hibernate mode, VDDCORE_BU and VDDCORE_RAM are set to 1.2v." value="0x0" />
        <value name="0p8v" caption="In Hibernate mode, VDDCORE_BU and VDDCORE_RAM are set to 0.8v" value="0x1" />
      </value-group>
      <value-group name="VREGCTRL__ULDOSTDBY">
        <value name="OFFINSTDBY" caption="Regulator is OFF while in sleep mode equal or deeper than standby mode. It is OFF in hibernate and backup mode as well." value="0x0" />
        <value name="ONINSTDBY" caption="Regulator is ON in Standby mode. is OFF from Hibernate mode. It is OFF in backup mode as well." value="0x1" />
      </value-group>
      <value-group name="VREGCTRL__ULDOLEVEL">
        <value name="1p2v" caption="Vout = 1.2v" value="0x0" />
        <value name="1p5v" caption="Vout = 1.5v" value="0x1" />
        <value name="1p8v" caption="Vout = 1.8v" value="0x2" />
        <value name="2p5v" caption="Vout = 2.5v" value="0x3" />
      </value-group>
      <value-group name="VREGCTRL__AVREGSTDBY">
        <value name="OFFINSTDBY" caption="Regulator is OFF while in sleep mode equal or deeper than standby mode. It is OFF in hibernate and backup mode as well." value="0x0" />
        <value name="ONINSTDBY" caption="Regulator is ON in Standby mode if AVREGEN bit is set. is OFF from Hibernate mode. It is OFF in backup mode as well." value="0x1" />
      </value-group>
      <value-group name="VREFCTRL__LPSTDBY">
        <value name="FullPower" caption="In standby mode, bandgap and enabled regulator(s) are set to nominal power mode." value="0x0" />
        <value name="LowPower" caption="In standby mode, bandgap and enabled regulator(s) are set to low power mode." value="0x1" />
      </value-group>
      <value-group name="VREFCTRL__LPHIB">
        <value name="FullPower" caption="In hibernate mode, bandgap is set to nominal power mode. As a consequence, enabled regulator(s) are set to nominal power mode." value="0x0" />
        <value name="LowPower" caption="In hibernate mode, bandgap is set to low power mode. As a consequence, enabled regulator(s) are set to low power mode." value="0x1" />
      </value-group>
      <value-group name="BKOUT__TGLOM">
        <value name="DISABLE" caption="The output does not toggle." value="0x0" />
        <value name="RTCTGL" caption="The output toggles on RTC event." value="0x1" />
        <value name="BKUPTGL" caption="The output is set when the device enters backup mode or battery backup mode. The output should then be cleared by software." value="0x2" />
      </value-group>
    </module>
    <module name="SysTick" id="SYSTEM_IP" version="1.0.0" caption="SysTick Timer">
      <register-group name="SysTick" caption="SysTick Timer">
        <register name="SYST_CSR" offset="0x0" rw="RW" size="4" access-size="4" caption="SysTick Control and Status Register">
          <bitfield name="ENABLE" caption="SysTick enable" mask="0x1" />
          <bitfield name="TICKINT" caption="Tick interrupt" mask="0x2" />
          <bitfield name="CLKSOURCE" caption="Clock source" mask="0x4" />
          <bitfield name="COUNTFLAG" caption="Count flag" mask="0x10000" />
        </register>
        <register name="SYST_RVR" offset="0x4" rw="RW" size="4" access-size="4" caption="SysTick Reload Value Register">
          <bitfield name="RELOAD" caption="Counter reload value" mask="0x1000000" />
        </register>
        <register name="SYST_CVR" offset="0x8" rw="RW" size="4" access-size="4" caption="SysTick Current Value Register">
          <bitfield name="CURRENT" caption="Current counter value" mask="0x1000000" />
        </register>
        <register name="SYST_CALIB" offset="0xC" rw="R" size="4" access-size="4" caption="SysTick Calibration Value Register">
          <bitfield name="TENMS" caption="Ten milliseconds" mask="0xFFFFFF" />
          <bitfield name="SKEW" caption="Skew" mask="0x40000000" />
          <bitfield name="NOREF" caption="No reference" mask="0x80000000" />
        </register>
      </register-group>
    </module>
    <module name="TCC" id="03610" name2="tmr_tcc_u2213_v4" version="4d0" caption="Timer Counter for Control Applications">
      <register-group name="TCC" caption="Timer Counter for Control Applications">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1" />
          <bitfield name="ENABLE" caption="Enable" mask="0x2" />
          <bitfield name="RESOLUTION" caption="Enhanced Resolution" mask="0x60" values="CTRLA__RESOLUTION" />
          <bitfield name="PRESCALER" caption="Prescaler" mask="0x700" values="CTRLA__PRESCALER" />
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x800" />
          <bitfield name="PRESCSYNC" caption="Prescaler and Counter Synchronization Selection" mask="0x3000" values="CTRLA__PRESCSYNC" />
          <bitfield name="ALOCK" caption="Auto Lock" mask="0x4000" />
          <bitfield name="MSYNC" caption="Master Synchronization (only for TCC Slave Instance)" mask="0x8000" />
          <bitfield name="FCYCLE" caption="Full Cycle" mask="0x10000" />
          <bitfield name="DMAOS" caption="DMA One-shot Trigger Mode" mask="0x800000" />
          <bitfield name="CPTEN0" caption="Capture Channel 0 Enable" mask="0x1000000" />
          <bitfield name="CPTEN1" caption="Capture Channel 1 Enable" mask="0x2000000" />
        </register>
        <register name="CTRLBCLR" offset="0x4" rw="RW" access="RWSYNC" size="1" atomic-op="clear:CTRLBCLR" initval="0x00" caption="Control B Clear">
          <bitfield name="DIR" caption="Counter Direction" mask="0x1" />
          <bitfield name="LUPD" caption="Lock Update" mask="0x2" />
          <bitfield name="ONESHOT" caption="One-Shot" mask="0x4" />
          <bitfield name="IDXCMD" caption="Ramp Index Command" mask="0x18" values="CTRLBCLR__IDXCMD" />
          <bitfield name="CMD" caption="TCC Command" mask="0xE0" values="CTRLBCLR__CMD" />
        </register>
        <register name="CTRLBSET" offset="0x5" rw="RW" access="RWSYNC" size="1" atomic-op="set:CTRLBSET" initval="0x00" caption="Control B Set">
          <bitfield name="DIR" caption="Counter Direction" mask="0x1" />
          <bitfield name="LUPD" caption="Lock Update" mask="0x2" />
          <bitfield name="ONESHOT" caption="One-Shot" mask="0x4" />
          <bitfield name="IDXCMD" caption="Ramp Index Command" mask="0x18" values="CTRLBSET__IDXCMD" />
          <bitfield name="CMD" caption="TCC Command" mask="0xE0" values="CTRLBSET__CMD" />
        </register>
        <register name="SYNCBUSY" offset="0x8" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy">
          <bitfield name="SWRST" caption="Swrst Busy" mask="0x1" />
          <bitfield name="ENABLE" caption="Enable Busy" mask="0x2" />
          <bitfield name="CTRLB" caption="Ctrlb Busy" mask="0x4" />
          <bitfield name="STATUS" caption="Status Busy" mask="0x8" />
          <bitfield name="COUNT" caption="Count Busy" mask="0x10" />
          <bitfield name="PATT" caption="Pattern Busy" mask="0x20" />
          <bitfield name="WAVE" caption="Wave Busy" mask="0x40" />
          <bitfield name="PER" caption="Period Busy" mask="0x80" />
          <bitfield name="CC0" caption="Compare Channel 0 Busy" mask="0x100" />
          <bitfield name="CC1" caption="Compare Channel 1 Busy" mask="0x200" />
        </register>
        <register name="FCTRLA" offset="0xC" rw="RW" size="4" initval="0x00000000" caption="Recoverable Fault A Configuration">
          <bitfield name="SRC" caption="Fault A Source" mask="0x3" values="FCTRLA__SRC" />
          <bitfield name="KEEP" caption="Fault A Keeper" mask="0x8" />
          <bitfield name="QUAL" caption="Fault A Qualification" mask="0x10" />
          <bitfield name="BLANK" caption="Fault A Blanking Mode" mask="0x60" values="FCTRLA__BLANK" />
          <bitfield name="RESTART" caption="Fault A Restart" mask="0x80" />
          <bitfield name="HALT" caption="Fault A Halt Mode" mask="0x300" values="FCTRLA__HALT" />
          <bitfield name="CHSEL" caption="Fault A Capture Channel" mask="0xC00" values="FCTRLA__CHSEL" />
          <bitfield name="CAPTURE" caption="Fault A Capture Action" mask="0x7000" values="FCTRLA__CAPTURE" />
          <bitfield name="BLANKPRESC" caption="Fault A Blanking Prescaler" mask="0x8000" />
          <bitfield name="BLANKVAL" caption="Fault A Blanking Time" mask="0xFF0000" />
          <bitfield name="FILTERVAL" caption="Fault A Filter Value" mask="0xF000000" />
        </register>
        <register name="FCTRLB" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="Recoverable Fault B Configuration">
          <bitfield name="SRC" caption="Fault B Source" mask="0x3" values="FCTRLB__SRC" />
          <bitfield name="KEEP" caption="Fault B Keeper" mask="0x8" />
          <bitfield name="QUAL" caption="Fault B Qualification" mask="0x10" />
          <bitfield name="BLANK" caption="Fault B Blanking Mode" mask="0x60" values="FCTRLB__BLANK" />
          <bitfield name="RESTART" caption="Fault B Restart" mask="0x80" />
          <bitfield name="HALT" caption="Fault B Halt Mode" mask="0x300" values="FCTRLB__HALT" />
          <bitfield name="CHSEL" caption="Fault B Capture Channel" mask="0xC00" values="FCTRLB__CHSEL" />
          <bitfield name="CAPTURE" caption="Fault B Capture Action" mask="0x7000" values="FCTRLB__CAPTURE" />
          <bitfield name="BLANKPRESC" caption="Fault B Blanking Prescaler" mask="0x8000" />
          <bitfield name="BLANKVAL" caption="Fault B Blanking Time" mask="0xFF0000" />
          <bitfield name="FILTERVAL" caption="Fault B Filter Value" mask="0xF000000" />
        </register>
        <register name="DRVCTRL" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="Driver Control">
          <bitfield name="NRE0" caption="Non-Recoverable State 0 Output Enable" mask="0x1" />
          <bitfield name="NRE1" caption="Non-Recoverable State 1 Output Enable" mask="0x2" />
          <bitfield name="NRV0" caption="Non-Recoverable State 0 Output Value" mask="0x100" />
          <bitfield name="NRV1" caption="Non-Recoverable State 1 Output Value" mask="0x200" />
          <bitfield name="INVEN0" caption="Output Waveform 0 Inversion" mask="0x10000" />
          <bitfield name="INVEN1" caption="Output Waveform 1 Inversion" mask="0x20000" />
          <bitfield name="FILTERVAL0" caption="Non-Recoverable Fault Input 0 Filter Value" mask="0xF000000" />
          <bitfield name="FILTERVAL1" caption="Non-Recoverable Fault Input 1 Filter Value" mask="0xF0000000" />
        </register>
        <register name="DBGCTRL" offset="0x1E" rw="RW" size="1" initval="0x00" caption="Debug Control">
          <bitfield name="DBGRUN" caption="Debug Running Mode" mask="0x1" />
          <bitfield name="FDDBD" caption="Fault Detection on Debug Break Detection" mask="0x4" />
        </register>
