zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00048.atdf
        <register name="WAVE" offset="0x3C" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="Waveform Control">
          <bitfield name="WAVEGEN" caption="Waveform Generation" mask="0x7" values="WAVE__WAVEGEN" />
          <bitfield name="RAMP" caption="Ramp Mode" mask="0x70" values="WAVE__RAMP" />
          <bitfield name="CIPEREN" caption="Circular period Enable" mask="0x80" />
          <bitfield name="CICCEN0" caption="Circular Channel 0 Enable" mask="0x100" />
          <bitfield name="CICCEN1" caption="Circular Channel 1 Enable" mask="0x200" />
          <bitfield name="POL0" caption="Channel 0 Polarity" mask="0x10000" />
          <bitfield name="POL1" caption="Channel 1 Polarity" mask="0x20000" />
        </register>
        <register name="PER" offset="0x40" rw="RW" access="WSYNC" size="4" initval="0x0000FFFF" caption="Period">
          <mode name="DEFAULT" qualifier="TCC.CTRLA.RESOLUTION" value="0" />
          <mode name="DITH4" qualifier="TCC.CTRLA.RESOLUTION" value="1" />
          <mode name="DITH5" qualifier="TCC.CTRLA.RESOLUTION" value="2" />
          <mode name="DITH6" qualifier="TCC.CTRLA.RESOLUTION" value="3" />
          <bitfield modes="DITH4" name="DITHER" caption="Dithering Cycle Number" mask="0xF" />
          <bitfield modes="DITH5" name="DITHER" caption="Dithering Cycle Number" mask="0x1F" />
          <bitfield modes="DITH6" name="DITHER" caption="Dithering Cycle Number" mask="0x3F" />
          <bitfield modes="DITH6" name="PER" caption="Period Value" mask="0xFFC0" />
          <bitfield modes="DITH5" name="PER" caption="Period Value" mask="0xFFE0" />
          <bitfield modes="DITH4" name="PER" caption="Period Value" mask="0xFFF0" />
          <bitfield modes="DEFAULT" name="PER" caption="Period Value" mask="0xFFFF" />
        </register>
        <register name="CC" offset="0x44" rw="RW" access="RWSYNC" size="4" count="2" initval="0x00000000" caption="Compare and Capture">
          <mode name="DEFAULT" qualifier="TCC.CTRLA.RESOLUTION" value="0" />
          <mode name="DITH4" qualifier="TCC.CTRLA.RESOLUTION" value="1" />
          <mode name="DITH5" qualifier="TCC.CTRLA.RESOLUTION" value="2" />
          <mode name="DITH6" qualifier="TCC.CTRLA.RESOLUTION" value="3" />
          <bitfield modes="DITH4" name="DITHER" caption="Dithering Cycle Number" mask="0xF" />
          <bitfield modes="DITH5" name="DITHER" caption="Dithering Cycle Number" mask="0x1F" />
          <bitfield modes="DITH6" name="DITHER" caption="Dithering Cycle Number" mask="0x3F" />
          <bitfield modes="DITH6" name="CC" caption="Channel Compare/Capture Value" mask="0xFFC0" />
          <bitfield modes="DITH5" name="CC" caption="Channel Compare/Capture Value" mask="0xFFE0" />
          <bitfield modes="DITH4" name="CC" caption="Channel Compare/Capture Value" mask="0xFFF0" />
          <bitfield modes="DEFAULT" name="CC" caption="Channel Compare/Capture Value" mask="0xFFFF" />
        </register>
        <register name="PERBUF" offset="0x6C" rw="RW" access="WSYNC" size="4" initval="0x0000FFFF" caption="Period Buffer">
          <mode name="DEFAULT" qualifier="TCC.CTRLA.RESOLUTION" value="0" />
          <mode name="DITH4" qualifier="TCC.CTRLA.RESOLUTION" value="1" />
          <mode name="DITH5" qualifier="TCC.CTRLA.RESOLUTION" value="2" />
          <mode name="DITH6" qualifier="TCC.CTRLA.RESOLUTION" value="3" />
          <bitfield modes="DITH4" name="DITHERBUF" caption="Dithering Buffer Cycle Number" mask="0xF" />
          <bitfield modes="DITH5" name="DITHERBUF" caption="Dithering Buffer Cycle Number" mask="0x1F" />
          <bitfield modes="DITH6" name="DITHERBUF" caption="Dithering Buffer Cycle Number" mask="0x3F" />
          <bitfield modes="DITH6" name="PERBUF" caption="Period Buffer Value" mask="0xFFC0" />
          <bitfield modes="DITH5" name="PERBUF" caption="Period Buffer Value" mask="0xFFE0" />
          <bitfield modes="DITH4" name="PERBUF" caption="Period Buffer Value" mask="0xFFF0" />
          <bitfield modes="DEFAULT" name="PERBUF" caption="Period Buffer Value" mask="0xFFFF" />
        </register>
        <register name="CCBUF" offset="0x70" rw="RW" access="WSYNC" size="4" count="2" initval="0x00000000" caption="Compare and Capture Buffer">
          <mode name="DEFAULT" qualifier="TCC.CTRLA.RESOLUTION" value="0" />
          <mode name="DITH4" qualifier="TCC.CTRLA.RESOLUTION" value="1" />
          <mode name="DITH5" qualifier="TCC.CTRLA.RESOLUTION" value="2" />
          <mode name="DITH6" qualifier="TCC.CTRLA.RESOLUTION" value="3" />
          <bitfield modes="DITH4" name="DITHERBUF" caption="Channel Compare/Capture Buffer Value" mask="0xF" />
          <bitfield modes="DITH5" name="DITHERBUF" caption="Dithering Buffer Cycle Number" mask="0x1F" />
          <bitfield modes="DITH6" name="DITHERBUF" caption="Dithering Buffer Cycle Number" mask="0x3F" />
          <bitfield modes="DITH6" name="CCBUF" caption="Channel Compare/Capture Buffer Value" mask="0xFFC0" />
          <bitfield modes="DITH5" name="CCBUF" caption="Channel Compare/Capture Buffer Value" mask="0xFFE0" />
          <bitfield modes="DITH4" name="CCBUF" caption="Dithering Buffer Cycle Number" mask="0xFFF0" />
          <bitfield modes="DEFAULT" name="CCBUF" caption="Channel Compare/Capture Buffer Value" mask="0xFFFF" />
        </register>
      </register-group>
      <value-group name="CTRLA__RESOLUTION">
        <value name="NONE" caption="Dithering is disabled" value="0" />
        <value name="DITH4" caption="Dithering is done every 16 PWM frames" value="1" />
        <value name="DITH5" caption="Dithering is done every 32 PWM frames" value="2" />
        <value name="DITH6" caption="Dithering is done every 64 PWM frames" value="3" />
      </value-group>
      <value-group name="CTRLA__PRESCALER">
        <value name="DIV1" caption="No division" value="0" />
        <value name="DIV2" caption="Divide by 2" value="1" />
        <value name="DIV4" caption="Divide by 4" value="2" />
        <value name="DIV8" caption="Divide by 8" value="3" />
        <value name="DIV16" caption="Divide by 16" value="4" />
        <value name="DIV64" caption="Divide by 64" value="5" />
        <value name="DIV256" caption="Divide by 256" value="6" />
        <value name="DIV1024" caption="Divide by 1024" value="7" />
      </value-group>
      <value-group name="CTRLA__PRESCSYNC">
        <value name="GCLK" caption="Reload or reset counter on next GCLK" value="0" />
        <value name="PRESC" caption="Reload or reset counter on next prescaler clock" value="1" />
        <value name="RESYNC" caption="Reload or reset counter on next GCLK and reset prescaler counter" value="2" />
      </value-group>
