zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00048.atdf
        <register name="CONFIG" offset="0x1" rw="RW" size="1" initval="0xBB" caption="Configuration">
          <bitfield name="PER" caption="Time-Out Period" mask="0xF" values="CONFIG__PER" />
          <bitfield name="WINDOW" caption="Window Mode Time-Out Period" mask="0xF0" values="CONFIG__WINDOW" />
        </register>
        <register name="EWCTRL" offset="0x2" rw="RW" size="1" initval="0x0B" caption="Early Warning Interrupt Control">
          <bitfield name="EWOFFSET" caption="Early Warning Interrupt Time Offset" mask="0xF" values="EWCTRL__EWOFFSET" />
        </register>
        <register name="INTENCLR" offset="0x4" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="EW" caption="Early Warning Interrupt Enable" mask="0x1" />
        </register>
        <register name="INTENSET" offset="0x5" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="EW" caption="Early Warning Interrupt Enable" mask="0x1" />
        </register>
        <register name="INTFLAG" offset="0x6" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="EW" caption="Early Warning" mask="0x1" />
        </register>
        <register name="SYNCBUSY" offset="0x8" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy">
          <bitfield name="ENABLE" caption="Enable Synchronization Busy" mask="0x2" />
          <bitfield name="WEN" caption="Window Enable Synchronization Busy" mask="0x4" />
          <bitfield name="RUNSTDBY" caption="Run During Standby Synchronization Busy" mask="0x8" />
          <bitfield name="ALWAYSON" caption="Always-On Synchronization Busy" mask="0x10" />
          <bitfield name="CLEAR" caption="Clear Synchronization Busy" mask="0x20" />
        </register>
        <register name="CLEAR" offset="0xC" rw="W" access="WSYNC" size="1" initval="0x00" caption="Clear">
          <bitfield name="CLEAR" caption="Watchdog Clear" mask="0xFF" values="CLEAR__CLEAR" />
        </register>
      </register-group>
      <value-group name="CONFIG__PER">
        <value name="CYC8" caption="8 clock cycles" value="0x0" />
        <value name="CYC16" caption="16 clock cycles" value="0x1" />
        <value name="CYC32" caption="32 clock cycles" value="0x2" />
        <value name="CYC64" caption="64 clock cycles" value="0x3" />
        <value name="CYC128" caption="128 clock cycles" value="0x4" />
        <value name="CYC256" caption="256 clock cycles" value="0x5" />
        <value name="CYC512" caption="512 clock cycles" value="0x6" />
        <value name="CYC1024" caption="1024 clock cycles" value="0x7" />
        <value name="CYC2048" caption="2048 clock cycles" value="0x8" />
        <value name="CYC4096" caption="4096 clock cycles" value="0x9" />
        <value name="CYC8192" caption="8192 clock cycles" value="0xA" />
        <value name="CYC16384" caption="16384 clock cycles" value="0xB" />
      </value-group>
      <value-group name="CONFIG__WINDOW">
        <value name="CYC8" caption="8 clock cycles" value="0x0" />
        <value name="CYC16" caption="16 clock cycles" value="0x1" />
        <value name="CYC32" caption="32 clock cycles" value="0x2" />
        <value name="CYC64" caption="64 clock cycles" value="0x3" />
        <value name="CYC128" caption="128 clock cycles" value="0x4" />
        <value name="CYC256" caption="256 clock cycles" value="0x5" />
        <value name="CYC512" caption="512 clock cycles" value="0x6" />
        <value name="CYC1024" caption="1024 clock cycles" value="0x7" />
        <value name="CYC2048" caption="2048 clock cycles" value="0x8" />
        <value name="CYC4096" caption="4096 clock cycles" value="0x9" />
        <value name="CYC8192" caption="8192 clock cycles" value="0xA" />
        <value name="CYC16384" caption="16384 clock cycles" value="0xB" />
      </value-group>
      <value-group name="EWCTRL__EWOFFSET">
        <value name="CYC8" caption="8 clock cycles" value="0x0" />
        <value name="CYC16" caption="16 clock cycles" value="0x1" />
        <value name="CYC32" caption="32 clock cycles" value="0x2" />
        <value name="CYC64" caption="64 clock cycles" value="0x3" />
        <value name="CYC128" caption="128 clock cycles" value="0x4" />
        <value name="CYC256" caption="256 clock cycles" value="0x5" />
        <value name="CYC512" caption="512 clock cycles" value="0x6" />
        <value name="CYC1024" caption="1024 clock cycles" value="0x7" />
        <value name="CYC2048" caption="2048 clock cycles" value="0x8" />
        <value name="CYC4096" caption="4096 clock cycles" value="0x9" />
        <value name="CYC8192" caption="8192 clock cycles" value="0xA" />
        <value name="CYC16384" caption="16384 clock cycles" value="0xB" />
      </value-group>
      <value-group name="CLEAR__CLEAR">
        <value name="KEY" caption="Clear Key" value="0xA5" />
      </value-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="P48" caption="P48">
      <pin position="1" pad="PA00" />
      <pin position="2" pad="PA01" />
      <pin position="3" pad="PA02" />
      <pin position="4" pad="PA03" />
      <pin position="5" pad="PA04" />
      <pin position="6" pad="VDDIO" />
      <pin position="7" pad="VSSIO2" />
      <pin position="8" pad="PA05" />
      <pin position="9" pad="PA06" />
      <pin position="10" pad="PA07" />
      <pin position="11" pad="PA08" />
      <pin position="12" pad="PA09" />
      <pin position="13" pad="PB00" />
      <pin position="14" pad="AVDD" />
      <pin position="15" pad="AVSS" />
      <pin position="16" pad="PB01" />
      <pin position="17" pad="PB02" />
      <pin position="18" pad="VDDIO" />
      <pin position="19" pad="VSSIO4" />
      <pin position="20" pad="VDDREG" />
      <pin position="21" pad="PB03" />
      <pin position="22" pad="PB04" />
      <pin position="23" pad="PB05" />
      <pin position="24" pad="PB06" />
      <pin position="25" pad="PC00" />
      <pin position="26" pad="PC01" />
      <pin position="27" pad="PC02" />
      <pin position="28" pad="PC03" />
      <pin position="29" pad="PC04" />
      <pin position="30" pad="RESET_N" />
      <pin position="31" pad="VDDIO" />
      <pin position="32" pad="VSSIO7" />
      <pin position="33" pad="PC05" />
      <pin position="34" pad="PC06" />
      <pin position="35" pad="PC07" />
      <pin position="36" pad="PC08" />
      <pin position="37" pad="PD00" />
      <pin position="38" pad="PD01" />
      <pin position="39" pad="PD02" />
      <pin position="40" pad="PD03" />
      <pin position="41" pad="VSSIO" />
      <pin position="42" pad="VDDF" />
      <pin position="43" pad="PD06" />
      <pin position="44" pad="PD07" />
      <pin position="45" pad="PD04" />
      <pin position="46" pad="PD05" />
      <pin position="47" pad="PD08" />
      <pin position="48" pad="PD09" />
    </pinout>
    <pinout name="P48_1" caption="P48_1">
      <pin position="1" pad="PA00" />
      <pin position="2" pad="PA01" />
      <pin position="3" pad="PA02" />
      <pin position="4" pad="PA03" />
      <pin position="5" pad="PA04" />
      <pin position="6" pad="VDDIO" />
      <pin position="7" pad="VSSIO2" />
      <pin position="8" pad="PA05" />
      <pin position="9" pad="PA06" />
      <pin position="10" pad="PA07" />
      <pin position="11" pad="PA08" />
      <pin position="12" pad="PA09" />
      <pin position="13" pad="PB00" />
      <pin position="14" pad="AVDD" />
      <pin position="15" pad="AVSS" />
      <pin position="16" pad="PB01" />
      <pin position="17" pad="PB02" />
      <pin position="18" pad="VDDIO" />
      <pin position="19" pad="VSSIO4" />
      <pin position="20" pad="VDDREG" />
      <pin position="21" pad="PB03" />
      <pin position="22" pad="PB04" />
      <pin position="23" pad="PB05" />
      <pin position="24" pad="PB06" />
      <pin position="25" pad="PC00" />
      <pin position="26" pad="PC01" />
      <pin position="27" pad="PC02" />
      <pin position="28" pad="PC03" />
      <pin position="29" pad="PC04" />
      <pin position="30" pad="RESET_N" />
      <pin position="31" pad="VDDIO" />
      <pin position="32" pad="VSSIO7" />
      <pin position="33" pad="PC05" />
      <pin position="34" pad="PC06" />
      <pin position="35" pad="PC07" />
      <pin position="36" pad="PC08" />
      <pin position="37" pad="PD00" />
      <pin position="38" pad="PD01" />
      <pin position="39" pad="PD02" />
      <pin position="40" pad="PD03" />
      <pin position="41" pad="VSSIO" />
      <pin position="42" pad="VDDF" />
      <pin position="43" pad="PD06" />
      <pin position="44" pad="PD07" />
      <pin position="45" pad="PD04" />
      <pin position="46" pad="PD05" />
      <pin position="47" pad="PD08" />
      <pin position="48" pad="PD09" />
    </pinout>
  </pinouts>
</avr-tools-device-file>